alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw2.0/hw/hw20_rtc_reg.h
// Copyright (c) Qualcomm Atheros, Inc.
// All rights reserved.
// Redistribution and use in source and binary forms, with or without modification, are permitted (subject to
// the limitations in the disclaimer below) provided that the following conditions are met:
//
// · Redistributions of source code must retain the above copyright notice, this list of conditions and the
//   following disclaimer.
// · Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the
//   following disclaimer in the documentation and/or other materials provided with the distribution.
// · Neither the name of nor the names of its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
//
// NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE. THIS SOFTWARE IS
// PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING,
// BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
// DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
// INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
// SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
// ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
// ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//==============================================================================
// Author(s): ="Atheros"
//==============================================================================
#ifndef _RTC_REG_REG_H_
#define _RTC_REG_REG_H_

#define RESET_CONTROL_ADDRESS 0x00000000
#define RESET_CONTROL_OFFSET 0x00000000
#define RESET_CONTROL_CPU_INIT_RESET_MSB 11
#define RESET_CONTROL_CPU_INIT_RESET_LSB 11
#define RESET_CONTROL_CPU_INIT_RESET_MASK 0x00000800
#define RESET_CONTROL_CPU_INIT_RESET_GET(x) \
    (((x)&RESET_CONTROL_CPU_INIT_RESET_MASK) >> RESET_CONTROL_CPU_INIT_RESET_LSB)
#define RESET_CONTROL_CPU_INIT_RESET_SET(x) \
    (((x) << RESET_CONTROL_CPU_INIT_RESET_LSB) & RESET_CONTROL_CPU_INIT_RESET_MASK)
#define RESET_CONTROL_VMC_REMAP_RESET_MSB 10
#define RESET_CONTROL_VMC_REMAP_RESET_LSB 10
#define RESET_CONTROL_VMC_REMAP_RESET_MASK 0x00000400
#define RESET_CONTROL_VMC_REMAP_RESET_GET(x) \
    (((x)&RESET_CONTROL_VMC_REMAP_RESET_MASK) >> RESET_CONTROL_VMC_REMAP_RESET_LSB)
#define RESET_CONTROL_VMC_REMAP_RESET_SET(x) \
    (((x) << RESET_CONTROL_VMC_REMAP_RESET_LSB) & RESET_CONTROL_VMC_REMAP_RESET_MASK)
#define RESET_CONTROL_RST_OUT_MSB 9
#define RESET_CONTROL_RST_OUT_LSB 9
#define RESET_CONTROL_RST_OUT_MASK 0x00000200
#define RESET_CONTROL_RST_OUT_GET(x) (((x)&RESET_CONTROL_RST_OUT_MASK) >> RESET_CONTROL_RST_OUT_LSB)
#define RESET_CONTROL_RST_OUT_SET(x) (((x) << RESET_CONTROL_RST_OUT_LSB) & RESET_CONTROL_RST_OUT_MASK)
#define RESET_CONTROL_COLD_RST_MSB 8
#define RESET_CONTROL_COLD_RST_LSB 8
#define RESET_CONTROL_COLD_RST_MASK 0x00000100
#define RESET_CONTROL_COLD_RST_GET(x) (((x)&RESET_CONTROL_COLD_RST_MASK) >> RESET_CONTROL_COLD_RST_LSB)
#define RESET_CONTROL_COLD_RST_SET(x) (((x) << RESET_CONTROL_COLD_RST_LSB) & RESET_CONTROL_COLD_RST_MASK)
#define RESET_CONTROL_WARM_RST_MSB 7
#define RESET_CONTROL_WARM_RST_LSB 7
#define RESET_CONTROL_WARM_RST_MASK 0x00000080
#define RESET_CONTROL_WARM_RST_GET(x) (((x)&RESET_CONTROL_WARM_RST_MASK) >> RESET_CONTROL_WARM_RST_LSB)
#define RESET_CONTROL_WARM_RST_SET(x) (((x) << RESET_CONTROL_WARM_RST_LSB) & RESET_CONTROL_WARM_RST_MASK)
#define RESET_CONTROL_CPU_WARM_RST_MSB 6
#define RESET_CONTROL_CPU_WARM_RST_LSB 6
#define RESET_CONTROL_CPU_WARM_RST_MASK 0x00000040
#define RESET_CONTROL_CPU_WARM_RST_GET(x) (((x)&RESET_CONTROL_CPU_WARM_RST_MASK) >> RESET_CONTROL_CPU_WARM_RST_LSB)
#define RESET_CONTROL_CPU_WARM_RST_SET(x) (((x) << RESET_CONTROL_CPU_WARM_RST_LSB) & RESET_CONTROL_CPU_WARM_RST_MASK)
#define RESET_CONTROL_MAC_COLD_RST_MSB 5
#define RESET_CONTROL_MAC_COLD_RST_LSB 5
#define RESET_CONTROL_MAC_COLD_RST_MASK 0x00000020
#define RESET_CONTROL_MAC_COLD_RST_GET(x) (((x)&RESET_CONTROL_MAC_COLD_RST_MASK) >> RESET_CONTROL_MAC_COLD_RST_LSB)
#define RESET_CONTROL_MAC_COLD_RST_SET(x) (((x) << RESET_CONTROL_MAC_COLD_RST_LSB) & RESET_CONTROL_MAC_COLD_RST_MASK)
#define RESET_CONTROL_MAC_WARM_RST_MSB 4
#define RESET_CONTROL_MAC_WARM_RST_LSB 4
#define RESET_CONTROL_MAC_WARM_RST_MASK 0x00000010
#define RESET_CONTROL_MAC_WARM_RST_GET(x) (((x)&RESET_CONTROL_MAC_WARM_RST_MASK) >> RESET_CONTROL_MAC_WARM_RST_LSB)
#define RESET_CONTROL_MAC_WARM_RST_SET(x) (((x) << RESET_CONTROL_MAC_WARM_RST_LSB) & RESET_CONTROL_MAC_WARM_RST_MASK)
#define RESET_CONTROL_MBOX_RST_MSB 2
#define RESET_CONTROL_MBOX_RST_LSB 2
#define RESET_CONTROL_MBOX_RST_MASK 0x00000004
#define RESET_CONTROL_MBOX_RST_GET(x) (((x)&RESET_CONTROL_MBOX_RST_MASK) >> RESET_CONTROL_MBOX_RST_LSB)
#define RESET_CONTROL_MBOX_RST_SET(x) (((x) << RESET_CONTROL_MBOX_RST_LSB) & RESET_CONTROL_MBOX_RST_MASK)
#define RESET_CONTROL_UART_RST_MSB 1
#define RESET_CONTROL_UART_RST_LSB 1
#define RESET_CONTROL_UART_RST_MASK 0x00000002
#define RESET_CONTROL_UART_RST_GET(x) (((x)&RESET_CONTROL_UART_RST_MASK) >> RESET_CONTROL_UART_RST_LSB)
#define RESET_CONTROL_UART_RST_SET(x) (((x) << RESET_CONTROL_UART_RST_LSB) & RESET_CONTROL_UART_RST_MASK)
#define RESET_CONTROL_SI0_RST_MSB 0
#define RESET_CONTROL_SI0_RST_LSB 0
#define RESET_CONTROL_SI0_RST_MASK 0x00000001
#define RESET_CONTROL_SI0_RST_GET(x) (((x)&RESET_CONTROL_SI0_RST_MASK) >> RESET_CONTROL_SI0_RST_LSB)
#define RESET_CONTROL_SI0_RST_SET(x) (((x) << RESET_CONTROL_SI0_RST_LSB) & RESET_CONTROL_SI0_RST_MASK)

#define XTAL_CONTROL_ADDRESS 0x00000004
#define XTAL_CONTROL_OFFSET 0x00000004
#define XTAL_CONTROL_TCXO_MSB 0
#define XTAL_CONTROL_TCXO_LSB 0
#define XTAL_CONTROL_TCXO_MASK 0x00000001
#define XTAL_CONTROL_TCXO_GET(x) (((x)&XTAL_CONTROL_TCXO_MASK) >> XTAL_CONTROL_TCXO_LSB)
#define XTAL_CONTROL_TCXO_SET(x) (((x) << XTAL_CONTROL_TCXO_LSB) & XTAL_CONTROL_TCXO_MASK)

#define TCXO_DETECT_ADDRESS 0x00000008
#define TCXO_DETECT_OFFSET 0x00000008
#define TCXO_DETECT_PRESENT_MSB 0
#define TCXO_DETECT_PRESENT_LSB 0
#define TCXO_DETECT_PRESENT_MASK 0x00000001
#define TCXO_DETECT_PRESENT_GET(x) (((x)&TCXO_DETECT_PRESENT_MASK) >> TCXO_DETECT_PRESENT_LSB)
#define TCXO_DETECT_PRESENT_SET(x) (((x) << TCXO_DETECT_PRESENT_LSB) & TCXO_DETECT_PRESENT_MASK)

#define XTAL_TEST_ADDRESS 0x0000000c
#define XTAL_TEST_OFFSET 0x0000000c
#define XTAL_TEST_NOTCXODET_MSB 0
#define XTAL_TEST_NOTCXODET_LSB 0
#define XTAL_TEST_NOTCXODET_MASK 0x00000001
#define XTAL_TEST_NOTCXODET_GET(x) (((x)&XTAL_TEST_NOTCXODET_MASK) >> XTAL_TEST_NOTCXODET_LSB)
#define XTAL_TEST_NOTCXODET_SET(x) (((x) << XTAL_TEST_NOTCXODET_LSB) & XTAL_TEST_NOTCXODET_MASK)

#define QUADRATURE_ADDRESS 0x00000010
#define QUADRATURE_OFFSET 0x00000010
#define QUADRATURE_ADC_MSB 5
#define QUADRATURE_ADC_LSB 4
#define QUADRATURE_ADC_MASK 0x00000030
#define QUADRATURE_ADC_GET(x) (((x)&QUADRATURE_ADC_MASK) >> QUADRATURE_ADC_LSB)
#define QUADRATURE_ADC_SET(x) (((x) << QUADRATURE_ADC_LSB) & QUADRATURE_ADC_MASK)
#define QUADRATURE_SEL_MSB 2
#define QUADRATURE_SEL_LSB 2
#define QUADRATURE_SEL_MASK 0x00000004
#define QUADRATURE_SEL_GET(x) (((x)&QUADRATURE_SEL_MASK) >> QUADRATURE_SEL_LSB)
#define QUADRATURE_SEL_SET(x) (((x) << QUADRATURE_SEL_LSB) & QUADRATURE_SEL_MASK)
#define QUADRATURE_DAC_MSB 1
#define QUADRATURE_DAC_LSB 0
#define QUADRATURE_DAC_MASK 0x00000003
#define QUADRATURE_DAC_GET(x) (((x)&QUADRATURE_DAC_MASK) >> QUADRATURE_DAC_LSB)
#define QUADRATURE_DAC_SET(x) (((x) << QUADRATURE_DAC_LSB) & QUADRATURE_DAC_MASK)

#define PLL_CONTROL_ADDRESS 0x00000014
#define PLL_CONTROL_OFFSET 0x00000014
#define PLL_CONTROL_DIG_TEST_CLK_MSB 20
#define PLL_CONTROL_DIG_TEST_CLK_LSB 20
#define PLL_CONTROL_DIG_TEST_CLK_MASK 0x00100000
#define PLL_CONTROL_DIG_TEST_CLK_GET(x) (((x)&PLL_CONTROL_DIG_TEST_CLK_MASK) >> PLL_CONTROL_DIG_TEST_CLK_LSB)
#define PLL_CONTROL_DIG_TEST_CLK_SET(x) (((x) << PLL_CONTROL_DIG_TEST_CLK_LSB) & PLL_CONTROL_DIG_TEST_CLK_MASK)
#define PLL_CONTROL_MAC_OVERRIDE_MSB 19
#define PLL_CONTROL_MAC_OVERRIDE_LSB 19
#define PLL_CONTROL_MAC_OVERRIDE_MASK 0x00080000
#define PLL_CONTROL_MAC_OVERRIDE_GET(x) (((x)&PLL_CONTROL_MAC_OVERRIDE_MASK) >> PLL_CONTROL_MAC_OVERRIDE_LSB)
#define PLL_CONTROL_MAC_OVERRIDE_SET(x) (((x) << PLL_CONTROL_MAC_OVERRIDE_LSB) & PLL_CONTROL_MAC_OVERRIDE_MASK)
#define PLL_CONTROL_NOPWD_MSB 18
#define PLL_CONTROL_NOPWD_LSB 18
#define PLL_CONTROL_NOPWD_MASK 0x00040000
#define PLL_CONTROL_NOPWD_GET(x) (((x)&PLL_CONTROL_NOPWD_MASK) >> PLL_CONTROL_NOPWD_LSB)
#define PLL_CONTROL_NOPWD_SET(x) (((x) << PLL_CONTROL_NOPWD_LSB) & PLL_CONTROL_NOPWD_MASK)
#define PLL_CONTROL_UPDATING_MSB 17
#define PLL_CONTROL_UPDATING_LSB 17
#define PLL_CONTROL_UPDATING_MASK 0x00020000
#define PLL_CONTROL_UPDATING_GET(x) (((x)&PLL_CONTROL_UPDATING_MASK) >> PLL_CONTROL_UPDATING_LSB)
#define PLL_CONTROL_UPDATING_SET(x) (((x) << PLL_CONTROL_UPDATING_LSB) & PLL_CONTROL_UPDATING_MASK)
#define PLL_CONTROL_BYPASS_MSB 16
#define PLL_CONTROL_BYPASS_LSB 16
#define PLL_CONTROL_BYPASS_MASK 0x00010000
#define PLL_CONTROL_BYPASS_GET(x) (((x)&PLL_CONTROL_BYPASS_MASK) >> PLL_CONTROL_BYPASS_LSB)
#define PLL_CONTROL_BYPASS_SET(x) (((x) << PLL_CONTROL_BYPASS_LSB) & PLL_CONTROL_BYPASS_MASK)
#define PLL_CONTROL_REFDIV_MSB 15
#define PLL_CONTROL_REFDIV_LSB 12
#define PLL_CONTROL_REFDIV_MASK 0x0000f000
#define PLL_CONTROL_REFDIV_GET(x) (((x)&PLL_CONTROL_REFDIV_MASK) >> PLL_CONTROL_REFDIV_LSB)
#define PLL_CONTROL_REFDIV_SET(x) (((x) << PLL_CONTROL_REFDIV_LSB) & PLL_CONTROL_REFDIV_MASK)
#define PLL_CONTROL_DIV_MSB 9
#define PLL_CONTROL_DIV_LSB 0
#define PLL_CONTROL_DIV_MASK 0x000003ff
#define PLL_CONTROL_DIV_GET(x) (((x)&PLL_CONTROL_DIV_MASK) >> PLL_CONTROL_DIV_LSB)
#define PLL_CONTROL_DIV_SET(x) (((x) << PLL_CONTROL_DIV_LSB) & PLL_CONTROL_DIV_MASK)

#define PLL_SETTLE_ADDRESS 0x00000018
#define PLL_SETTLE_OFFSET 0x00000018
#define PLL_SETTLE_TIME_MSB 11
#define PLL_SETTLE_TIME_LSB 0
#define PLL_SETTLE_TIME_MASK 0x00000fff
#define PLL_SETTLE_TIME_GET(x) (((x)&PLL_SETTLE_TIME_MASK) >> PLL_SETTLE_TIME_LSB)
#define PLL_SETTLE_TIME_SET(x) (((x) << PLL_SETTLE_TIME_LSB) & PLL_SETTLE_TIME_MASK)

#define XTAL_SETTLE_ADDRESS 0x0000001c
#define XTAL_SETTLE_OFFSET 0x0000001c
#define XTAL_SETTLE_TIME_MSB 7
#define XTAL_SETTLE_TIME_LSB 0
#define XTAL_SETTLE_TIME_MASK 0x000000ff
#define XTAL_SETTLE_TIME_GET(x) (((x)&XTAL_SETTLE_TIME_MASK) >> XTAL_SETTLE_TIME_LSB)
#define XTAL_SETTLE_TIME_SET(x) (((x) << XTAL_SETTLE_TIME_LSB) & XTAL_SETTLE_TIME_MASK)

#define CPU_CLOCK_ADDRESS 0x00000020
#define CPU_CLOCK_OFFSET 0x00000020
#define CPU_CLOCK_STANDARD_MSB 1
#define CPU_CLOCK_STANDARD_LSB 0
#define CPU_CLOCK_STANDARD_MASK 0x00000003
#define CPU_CLOCK_STANDARD_GET(x) (((x)&CPU_CLOCK_STANDARD_MASK) >> CPU_CLOCK_STANDARD_LSB)
#define CPU_CLOCK_STANDARD_SET(x) (((x) << CPU_CLOCK_STANDARD_LSB) & CPU_CLOCK_STANDARD_MASK)

#define CLOCK_OUT_ADDRESS 0x00000024
#define CLOCK_OUT_OFFSET 0x00000024
#define CLOCK_OUT_SELECT_MSB 3
#define CLOCK_OUT_SELECT_LSB 0
#define CLOCK_OUT_SELECT_MASK 0x0000000f
#define CLOCK_OUT_SELECT_GET(x) (((x)&CLOCK_OUT_SELECT_MASK) >> CLOCK_OUT_SELECT_LSB)
#define CLOCK_OUT_SELECT_SET(x) (((x) << CLOCK_OUT_SELECT_LSB) & CLOCK_OUT_SELECT_MASK)

