alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw2.0/hw/hw20_rtc_reg.h
#define CLOCK_CONTROL_ADDRESS 0x00000028
#define CLOCK_CONTROL_OFFSET 0x00000028
#define CLOCK_CONTROL_LF_CLK32_MSB 2
#define CLOCK_CONTROL_LF_CLK32_LSB 2
#define CLOCK_CONTROL_LF_CLK32_MASK 0x00000004
#define CLOCK_CONTROL_LF_CLK32_GET(x) (((x)&CLOCK_CONTROL_LF_CLK32_MASK) >> CLOCK_CONTROL_LF_CLK32_LSB)
#define CLOCK_CONTROL_LF_CLK32_SET(x) (((x) << CLOCK_CONTROL_LF_CLK32_LSB) & CLOCK_CONTROL_LF_CLK32_MASK)
#define CLOCK_CONTROL_UART_CLK_MSB 1
#define CLOCK_CONTROL_UART_CLK_LSB 1
#define CLOCK_CONTROL_UART_CLK_MASK 0x00000002
#define CLOCK_CONTROL_UART_CLK_GET(x) (((x)&CLOCK_CONTROL_UART_CLK_MASK) >> CLOCK_CONTROL_UART_CLK_LSB)
#define CLOCK_CONTROL_UART_CLK_SET(x) (((x) << CLOCK_CONTROL_UART_CLK_LSB) & CLOCK_CONTROL_UART_CLK_MASK)
#define CLOCK_CONTROL_SI0_CLK_MSB 0
#define CLOCK_CONTROL_SI0_CLK_LSB 0
#define CLOCK_CONTROL_SI0_CLK_MASK 0x00000001
#define CLOCK_CONTROL_SI0_CLK_GET(x) (((x)&CLOCK_CONTROL_SI0_CLK_MASK) >> CLOCK_CONTROL_SI0_CLK_LSB)
#define CLOCK_CONTROL_SI0_CLK_SET(x) (((x) << CLOCK_CONTROL_SI0_CLK_LSB) & CLOCK_CONTROL_SI0_CLK_MASK)

#define BIAS_OVERRIDE_ADDRESS 0x0000002c
#define BIAS_OVERRIDE_OFFSET 0x0000002c
#define BIAS_OVERRIDE_ON_MSB 0
#define BIAS_OVERRIDE_ON_LSB 0
#define BIAS_OVERRIDE_ON_MASK 0x00000001
#define BIAS_OVERRIDE_ON_GET(x) (((x)&BIAS_OVERRIDE_ON_MASK) >> BIAS_OVERRIDE_ON_LSB)
#define BIAS_OVERRIDE_ON_SET(x) (((x) << BIAS_OVERRIDE_ON_LSB) & BIAS_OVERRIDE_ON_MASK)

#define WDT_CONTROL_ADDRESS 0x00000030
#define WDT_CONTROL_OFFSET 0x00000030
#define WDT_CONTROL_ACTION_MSB 2
#define WDT_CONTROL_ACTION_LSB 0
#define WDT_CONTROL_ACTION_MASK 0x00000007
#define WDT_CONTROL_ACTION_GET(x) (((x)&WDT_CONTROL_ACTION_MASK) >> WDT_CONTROL_ACTION_LSB)
#define WDT_CONTROL_ACTION_SET(x) (((x) << WDT_CONTROL_ACTION_LSB) & WDT_CONTROL_ACTION_MASK)

#define WDT_STATUS_ADDRESS 0x00000034
#define WDT_STATUS_OFFSET 0x00000034
#define WDT_STATUS_INTERRUPT_MSB 0
#define WDT_STATUS_INTERRUPT_LSB 0
#define WDT_STATUS_INTERRUPT_MASK 0x00000001
#define WDT_STATUS_INTERRUPT_GET(x) (((x)&WDT_STATUS_INTERRUPT_MASK) >> WDT_STATUS_INTERRUPT_LSB)
#define WDT_STATUS_INTERRUPT_SET(x) (((x) << WDT_STATUS_INTERRUPT_LSB) & WDT_STATUS_INTERRUPT_MASK)

#define WDT_ADDRESS 0x00000038
#define WDT_OFFSET 0x00000038
#define WDT_TARGET_MSB 21
#define WDT_TARGET_LSB 0
#define WDT_TARGET_MASK 0x003fffff
#define WDT_TARGET_GET(x) (((x)&WDT_TARGET_MASK) >> WDT_TARGET_LSB)
#define WDT_TARGET_SET(x) (((x) << WDT_TARGET_LSB) & WDT_TARGET_MASK)

#define WDT_COUNT_ADDRESS 0x0000003c
#define WDT_COUNT_OFFSET 0x0000003c
#define WDT_COUNT_VALUE_MSB 21
#define WDT_COUNT_VALUE_LSB 0
#define WDT_COUNT_VALUE_MASK 0x003fffff
#define WDT_COUNT_VALUE_GET(x) (((x)&WDT_COUNT_VALUE_MASK) >> WDT_COUNT_VALUE_LSB)
#define WDT_COUNT_VALUE_SET(x) (((x) << WDT_COUNT_VALUE_LSB) & WDT_COUNT_VALUE_MASK)

#define WDT_RESET_ADDRESS 0x00000040
#define WDT_RESET_OFFSET 0x00000040
#define WDT_RESET_VALUE_MSB 0
#define WDT_RESET_VALUE_LSB 0
#define WDT_RESET_VALUE_MASK 0x00000001
#define WDT_RESET_VALUE_GET(x) (((x)&WDT_RESET_VALUE_MASK) >> WDT_RESET_VALUE_LSB)
#define WDT_RESET_VALUE_SET(x) (((x) << WDT_RESET_VALUE_LSB) & WDT_RESET_VALUE_MASK)

#define INT_STATUS_ADDRESS 0x00000044
#define INT_STATUS_OFFSET 0x00000044
#define INT_STATUS_RTC_POWER_MSB 14
#define INT_STATUS_RTC_POWER_LSB 14
#define INT_STATUS_RTC_POWER_MASK 0x00004000
#define INT_STATUS_RTC_POWER_GET(x) (((x)&INT_STATUS_RTC_POWER_MASK) >> INT_STATUS_RTC_POWER_LSB)
#define INT_STATUS_RTC_POWER_SET(x) (((x) << INT_STATUS_RTC_POWER_LSB) & INT_STATUS_RTC_POWER_MASK)
#define INT_STATUS_MAC_MSB 13
#define INT_STATUS_MAC_LSB 13
#define INT_STATUS_MAC_MASK 0x00002000
#define INT_STATUS_MAC_GET(x) (((x)&INT_STATUS_MAC_MASK) >> INT_STATUS_MAC_LSB)
#define INT_STATUS_MAC_SET(x) (((x) << INT_STATUS_MAC_LSB) & INT_STATUS_MAC_MASK)
#define INT_STATUS_MAILBOX_MSB 12
#define INT_STATUS_MAILBOX_LSB 12
#define INT_STATUS_MAILBOX_MASK 0x00001000
#define INT_STATUS_MAILBOX_GET(x) (((x)&INT_STATUS_MAILBOX_MASK) >> INT_STATUS_MAILBOX_LSB)
#define INT_STATUS_MAILBOX_SET(x) (((x) << INT_STATUS_MAILBOX_LSB) & INT_STATUS_MAILBOX_MASK)
#define INT_STATUS_RTC_ALARM_MSB 11
#define INT_STATUS_RTC_ALARM_LSB 11
#define INT_STATUS_RTC_ALARM_MASK 0x00000800
#define INT_STATUS_RTC_ALARM_GET(x) (((x)&INT_STATUS_RTC_ALARM_MASK) >> INT_STATUS_RTC_ALARM_LSB)
#define INT_STATUS_RTC_ALARM_SET(x) (((x) << INT_STATUS_RTC_ALARM_LSB) & INT_STATUS_RTC_ALARM_MASK)
#define INT_STATUS_HF_TIMER_MSB 10
#define INT_STATUS_HF_TIMER_LSB 10
#define INT_STATUS_HF_TIMER_MASK 0x00000400
#define INT_STATUS_HF_TIMER_GET(x) (((x)&INT_STATUS_HF_TIMER_MASK) >> INT_STATUS_HF_TIMER_LSB)
#define INT_STATUS_HF_TIMER_SET(x) (((x) << INT_STATUS_HF_TIMER_LSB) & INT_STATUS_HF_TIMER_MASK)
#define INT_STATUS_LF_TIMER3_MSB 9
#define INT_STATUS_LF_TIMER3_LSB 9
#define INT_STATUS_LF_TIMER3_MASK 0x00000200
#define INT_STATUS_LF_TIMER3_GET(x) (((x)&INT_STATUS_LF_TIMER3_MASK) >> INT_STATUS_LF_TIMER3_LSB)
#define INT_STATUS_LF_TIMER3_SET(x) (((x) << INT_STATUS_LF_TIMER3_LSB) & INT_STATUS_LF_TIMER3_MASK)
#define INT_STATUS_LF_TIMER2_MSB 8
#define INT_STATUS_LF_TIMER2_LSB 8
#define INT_STATUS_LF_TIMER2_MASK 0x00000100
#define INT_STATUS_LF_TIMER2_GET(x) (((x)&INT_STATUS_LF_TIMER2_MASK) >> INT_STATUS_LF_TIMER2_LSB)
#define INT_STATUS_LF_TIMER2_SET(x) (((x) << INT_STATUS_LF_TIMER2_LSB) & INT_STATUS_LF_TIMER2_MASK)
#define INT_STATUS_LF_TIMER1_MSB 7
#define INT_STATUS_LF_TIMER1_LSB 7
#define INT_STATUS_LF_TIMER1_MASK 0x00000080
#define INT_STATUS_LF_TIMER1_GET(x) (((x)&INT_STATUS_LF_TIMER1_MASK) >> INT_STATUS_LF_TIMER1_LSB)
#define INT_STATUS_LF_TIMER1_SET(x) (((x) << INT_STATUS_LF_TIMER1_LSB) & INT_STATUS_LF_TIMER1_MASK)
#define INT_STATUS_LF_TIMER0_MSB 6
#define INT_STATUS_LF_TIMER0_LSB 6
#define INT_STATUS_LF_TIMER0_MASK 0x00000040
#define INT_STATUS_LF_TIMER0_GET(x) (((x)&INT_STATUS_LF_TIMER0_MASK) >> INT_STATUS_LF_TIMER0_LSB)
#define INT_STATUS_LF_TIMER0_SET(x) (((x) << INT_STATUS_LF_TIMER0_LSB) & INT_STATUS_LF_TIMER0_MASK)
#define INT_STATUS_KEYPAD_MSB 5
#define INT_STATUS_KEYPAD_LSB 5
#define INT_STATUS_KEYPAD_MASK 0x00000020
#define INT_STATUS_KEYPAD_GET(x) (((x)&INT_STATUS_KEYPAD_MASK) >> INT_STATUS_KEYPAD_LSB)
#define INT_STATUS_KEYPAD_SET(x) (((x) << INT_STATUS_KEYPAD_LSB) & INT_STATUS_KEYPAD_MASK)
#define INT_STATUS_SI_MSB 4
#define INT_STATUS_SI_LSB 4
#define INT_STATUS_SI_MASK 0x00000010
#define INT_STATUS_SI_GET(x) (((x)&INT_STATUS_SI_MASK) >> INT_STATUS_SI_LSB)
#define INT_STATUS_SI_SET(x) (((x) << INT_STATUS_SI_LSB) & INT_STATUS_SI_MASK)
#define INT_STATUS_GPIO_MSB 3
#define INT_STATUS_GPIO_LSB 3
#define INT_STATUS_GPIO_MASK 0x00000008
#define INT_STATUS_GPIO_GET(x) (((x)&INT_STATUS_GPIO_MASK) >> INT_STATUS_GPIO_LSB)
#define INT_STATUS_GPIO_SET(x) (((x) << INT_STATUS_GPIO_LSB) & INT_STATUS_GPIO_MASK)
#define INT_STATUS_UART_MSB 2
#define INT_STATUS_UART_LSB 2
#define INT_STATUS_UART_MASK 0x00000004
#define INT_STATUS_UART_GET(x) (((x)&INT_STATUS_UART_MASK) >> INT_STATUS_UART_LSB)
#define INT_STATUS_UART_SET(x) (((x) << INT_STATUS_UART_LSB) & INT_STATUS_UART_MASK)
#define INT_STATUS_ERROR_MSB 1
#define INT_STATUS_ERROR_LSB 1
#define INT_STATUS_ERROR_MASK 0x00000002
#define INT_STATUS_ERROR_GET(x) (((x)&INT_STATUS_ERROR_MASK) >> INT_STATUS_ERROR_LSB)
#define INT_STATUS_ERROR_SET(x) (((x) << INT_STATUS_ERROR_LSB) & INT_STATUS_ERROR_MASK)
#define INT_STATUS_WDT_INT_MSB 0
#define INT_STATUS_WDT_INT_LSB 0
#define INT_STATUS_WDT_INT_MASK 0x00000001
#define INT_STATUS_WDT_INT_GET(x) (((x)&INT_STATUS_WDT_INT_MASK) >> INT_STATUS_WDT_INT_LSB)
#define INT_STATUS_WDT_INT_SET(x) (((x) << INT_STATUS_WDT_INT_LSB) & INT_STATUS_WDT_INT_MASK)

#define LF_TIMER0_ADDRESS 0x00000048
#define LF_TIMER0_OFFSET 0x00000048
#define LF_TIMER0_TARGET_MSB 31
#define LF_TIMER0_TARGET_LSB 0
#define LF_TIMER0_TARGET_MASK 0xffffffff
#define LF_TIMER0_TARGET_GET(x) (((x)&LF_TIMER0_TARGET_MASK) >> LF_TIMER0_TARGET_LSB)
#define LF_TIMER0_TARGET_SET(x) (((x) << LF_TIMER0_TARGET_LSB) & LF_TIMER0_TARGET_MASK)

#define LF_TIMER_COUNT0_ADDRESS 0x0000004c
#define LF_TIMER_COUNT0_OFFSET 0x0000004c
#define LF_TIMER_COUNT0_VALUE_MSB 31
#define LF_TIMER_COUNT0_VALUE_LSB 0
#define LF_TIMER_COUNT0_VALUE_MASK 0xffffffff
#define LF_TIMER_COUNT0_VALUE_GET(x) (((x)&LF_TIMER_COUNT0_VALUE_MASK) >> LF_TIMER_COUNT0_VALUE_LSB)
#define LF_TIMER_COUNT0_VALUE_SET(x) (((x) << LF_TIMER_COUNT0_VALUE_LSB) & LF_TIMER_COUNT0_VALUE_MASK)

#define LF_TIMER_CONTROL0_ADDRESS 0x00000050
#define LF_TIMER_CONTROL0_OFFSET 0x00000050
#define LF_TIMER_CONTROL0_ENABLE_MSB 2
#define LF_TIMER_CONTROL0_ENABLE_LSB 2
#define LF_TIMER_CONTROL0_ENABLE_MASK 0x00000004
#define LF_TIMER_CONTROL0_ENABLE_GET(x) (((x)&LF_TIMER_CONTROL0_ENABLE_MASK) >> LF_TIMER_CONTROL0_ENABLE_LSB)
#define LF_TIMER_CONTROL0_ENABLE_SET(x) (((x) << LF_TIMER_CONTROL0_ENABLE_LSB) & LF_TIMER_CONTROL0_ENABLE_MASK)
#define LF_TIMER_CONTROL0_AUTO_RESTART_MSB 1
#define LF_TIMER_CONTROL0_AUTO_RESTART_LSB 1
#define LF_TIMER_CONTROL0_AUTO_RESTART_MASK 0x00000002
#define LF_TIMER_CONTROL0_AUTO_RESTART_GET(x) \
    (((x)&LF_TIMER_CONTROL0_AUTO_RESTART_MASK) >> LF_TIMER_CONTROL0_AUTO_RESTART_LSB)
#define LF_TIMER_CONTROL0_AUTO_RESTART_SET(x) \
    (((x) << LF_TIMER_CONTROL0_AUTO_RESTART_LSB) & LF_TIMER_CONTROL0_AUTO_RESTART_MASK)
#define LF_TIMER_CONTROL0_RESET_MSB 0
#define LF_TIMER_CONTROL0_RESET_LSB 0
#define LF_TIMER_CONTROL0_RESET_MASK 0x00000001
#define LF_TIMER_CONTROL0_RESET_GET(x) (((x)&LF_TIMER_CONTROL0_RESET_MASK) >> LF_TIMER_CONTROL0_RESET_LSB)
#define LF_TIMER_CONTROL0_RESET_SET(x) (((x) << LF_TIMER_CONTROL0_RESET_LSB) & LF_TIMER_CONTROL0_RESET_MASK)

#define LF_TIMER_STATUS0_ADDRESS 0x00000054
#define LF_TIMER_STATUS0_OFFSET 0x00000054
#define LF_TIMER_STATUS0_INTERRUPT_MSB 0
#define LF_TIMER_STATUS0_INTERRUPT_LSB 0
#define LF_TIMER_STATUS0_INTERRUPT_MASK 0x00000001
#define LF_TIMER_STATUS0_INTERRUPT_GET(x) (((x)&LF_TIMER_STATUS0_INTERRUPT_MASK) >> LF_TIMER_STATUS0_INTERRUPT_LSB)
#define LF_TIMER_STATUS0_INTERRUPT_SET(x) (((x) << LF_TIMER_STATUS0_INTERRUPT_LSB) & LF_TIMER_STATUS0_INTERRUPT_MASK)

