alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw2.0/hw/hw20_rtc_reg.h
#define LF_TIMER1_ADDRESS 0x00000058
#define LF_TIMER1_OFFSET 0x00000058
#define LF_TIMER1_TARGET_MSB 31
#define LF_TIMER1_TARGET_LSB 0
#define LF_TIMER1_TARGET_MASK 0xffffffff
#define LF_TIMER1_TARGET_GET(x) (((x)&LF_TIMER1_TARGET_MASK) >> LF_TIMER1_TARGET_LSB)
#define LF_TIMER1_TARGET_SET(x) (((x) << LF_TIMER1_TARGET_LSB) & LF_TIMER1_TARGET_MASK)

#define LF_TIMER_COUNT1_ADDRESS 0x0000005c
#define LF_TIMER_COUNT1_OFFSET 0x0000005c
#define LF_TIMER_COUNT1_VALUE_MSB 31
#define LF_TIMER_COUNT1_VALUE_LSB 0
#define LF_TIMER_COUNT1_VALUE_MASK 0xffffffff
#define LF_TIMER_COUNT1_VALUE_GET(x) (((x)&LF_TIMER_COUNT1_VALUE_MASK) >> LF_TIMER_COUNT1_VALUE_LSB)
#define LF_TIMER_COUNT1_VALUE_SET(x) (((x) << LF_TIMER_COUNT1_VALUE_LSB) & LF_TIMER_COUNT1_VALUE_MASK)

#define LF_TIMER_CONTROL1_ADDRESS 0x00000060
#define LF_TIMER_CONTROL1_OFFSET 0x00000060
#define LF_TIMER_CONTROL1_ENABLE_MSB 2
#define LF_TIMER_CONTROL1_ENABLE_LSB 2
#define LF_TIMER_CONTROL1_ENABLE_MASK 0x00000004
#define LF_TIMER_CONTROL1_ENABLE_GET(x) (((x)&LF_TIMER_CONTROL1_ENABLE_MASK) >> LF_TIMER_CONTROL1_ENABLE_LSB)
#define LF_TIMER_CONTROL1_ENABLE_SET(x) (((x) << LF_TIMER_CONTROL1_ENABLE_LSB) & LF_TIMER_CONTROL1_ENABLE_MASK)
#define LF_TIMER_CONTROL1_AUTO_RESTART_MSB 1
#define LF_TIMER_CONTROL1_AUTO_RESTART_LSB 1
#define LF_TIMER_CONTROL1_AUTO_RESTART_MASK 0x00000002
#define LF_TIMER_CONTROL1_AUTO_RESTART_GET(x) \
    (((x)&LF_TIMER_CONTROL1_AUTO_RESTART_MASK) >> LF_TIMER_CONTROL1_AUTO_RESTART_LSB)
#define LF_TIMER_CONTROL1_AUTO_RESTART_SET(x) \
    (((x) << LF_TIMER_CONTROL1_AUTO_RESTART_LSB) & LF_TIMER_CONTROL1_AUTO_RESTART_MASK)
#define LF_TIMER_CONTROL1_RESET_MSB 0
#define LF_TIMER_CONTROL1_RESET_LSB 0
#define LF_TIMER_CONTROL1_RESET_MASK 0x00000001
#define LF_TIMER_CONTROL1_RESET_GET(x) (((x)&LF_TIMER_CONTROL1_RESET_MASK) >> LF_TIMER_CONTROL1_RESET_LSB)
#define LF_TIMER_CONTROL1_RESET_SET(x) (((x) << LF_TIMER_CONTROL1_RESET_LSB) & LF_TIMER_CONTROL1_RESET_MASK)

#define LF_TIMER_STATUS1_ADDRESS 0x00000064
#define LF_TIMER_STATUS1_OFFSET 0x00000064
#define LF_TIMER_STATUS1_INTERRUPT_MSB 0
#define LF_TIMER_STATUS1_INTERRUPT_LSB 0
#define LF_TIMER_STATUS1_INTERRUPT_MASK 0x00000001
#define LF_TIMER_STATUS1_INTERRUPT_GET(x) (((x)&LF_TIMER_STATUS1_INTERRUPT_MASK) >> LF_TIMER_STATUS1_INTERRUPT_LSB)
#define LF_TIMER_STATUS1_INTERRUPT_SET(x) (((x) << LF_TIMER_STATUS1_INTERRUPT_LSB) & LF_TIMER_STATUS1_INTERRUPT_MASK)

#define LF_TIMER2_ADDRESS 0x00000068
#define LF_TIMER2_OFFSET 0x00000068
#define LF_TIMER2_TARGET_MSB 31
#define LF_TIMER2_TARGET_LSB 0
#define LF_TIMER2_TARGET_MASK 0xffffffff
#define LF_TIMER2_TARGET_GET(x) (((x)&LF_TIMER2_TARGET_MASK) >> LF_TIMER2_TARGET_LSB)
#define LF_TIMER2_TARGET_SET(x) (((x) << LF_TIMER2_TARGET_LSB) & LF_TIMER2_TARGET_MASK)

#define LF_TIMER_COUNT2_ADDRESS 0x0000006c
#define LF_TIMER_COUNT2_OFFSET 0x0000006c
#define LF_TIMER_COUNT2_VALUE_MSB 31
#define LF_TIMER_COUNT2_VALUE_LSB 0
#define LF_TIMER_COUNT2_VALUE_MASK 0xffffffff
#define LF_TIMER_COUNT2_VALUE_GET(x) (((x)&LF_TIMER_COUNT2_VALUE_MASK) >> LF_TIMER_COUNT2_VALUE_LSB)
#define LF_TIMER_COUNT2_VALUE_SET(x) (((x) << LF_TIMER_COUNT2_VALUE_LSB) & LF_TIMER_COUNT2_VALUE_MASK)

#define LF_TIMER_CONTROL2_ADDRESS 0x00000070
#define LF_TIMER_CONTROL2_OFFSET 0x00000070
#define LF_TIMER_CONTROL2_ENABLE_MSB 2
#define LF_TIMER_CONTROL2_ENABLE_LSB 2
#define LF_TIMER_CONTROL2_ENABLE_MASK 0x00000004
#define LF_TIMER_CONTROL2_ENABLE_GET(x) (((x)&LF_TIMER_CONTROL2_ENABLE_MASK) >> LF_TIMER_CONTROL2_ENABLE_LSB)
#define LF_TIMER_CONTROL2_ENABLE_SET(x) (((x) << LF_TIMER_CONTROL2_ENABLE_LSB) & LF_TIMER_CONTROL2_ENABLE_MASK)
#define LF_TIMER_CONTROL2_AUTO_RESTART_MSB 1
#define LF_TIMER_CONTROL2_AUTO_RESTART_LSB 1
#define LF_TIMER_CONTROL2_AUTO_RESTART_MASK 0x00000002
#define LF_TIMER_CONTROL2_AUTO_RESTART_GET(x) \
    (((x)&LF_TIMER_CONTROL2_AUTO_RESTART_MASK) >> LF_TIMER_CONTROL2_AUTO_RESTART_LSB)
#define LF_TIMER_CONTROL2_AUTO_RESTART_SET(x) \
    (((x) << LF_TIMER_CONTROL2_AUTO_RESTART_LSB) & LF_TIMER_CONTROL2_AUTO_RESTART_MASK)
#define LF_TIMER_CONTROL2_RESET_MSB 0
#define LF_TIMER_CONTROL2_RESET_LSB 0
#define LF_TIMER_CONTROL2_RESET_MASK 0x00000001
#define LF_TIMER_CONTROL2_RESET_GET(x) (((x)&LF_TIMER_CONTROL2_RESET_MASK) >> LF_TIMER_CONTROL2_RESET_LSB)
#define LF_TIMER_CONTROL2_RESET_SET(x) (((x) << LF_TIMER_CONTROL2_RESET_LSB) & LF_TIMER_CONTROL2_RESET_MASK)

#define LF_TIMER_STATUS2_ADDRESS 0x00000074
#define LF_TIMER_STATUS2_OFFSET 0x00000074
#define LF_TIMER_STATUS2_INTERRUPT_MSB 0
#define LF_TIMER_STATUS2_INTERRUPT_LSB 0
#define LF_TIMER_STATUS2_INTERRUPT_MASK 0x00000001
#define LF_TIMER_STATUS2_INTERRUPT_GET(x) (((x)&LF_TIMER_STATUS2_INTERRUPT_MASK) >> LF_TIMER_STATUS2_INTERRUPT_LSB)
#define LF_TIMER_STATUS2_INTERRUPT_SET(x) (((x) << LF_TIMER_STATUS2_INTERRUPT_LSB) & LF_TIMER_STATUS2_INTERRUPT_MASK)

#define LF_TIMER3_ADDRESS 0x00000078
#define LF_TIMER3_OFFSET 0x00000078
#define LF_TIMER3_TARGET_MSB 31
#define LF_TIMER3_TARGET_LSB 0
#define LF_TIMER3_TARGET_MASK 0xffffffff
#define LF_TIMER3_TARGET_GET(x) (((x)&LF_TIMER3_TARGET_MASK) >> LF_TIMER3_TARGET_LSB)
#define LF_TIMER3_TARGET_SET(x) (((x) << LF_TIMER3_TARGET_LSB) & LF_TIMER3_TARGET_MASK)

#define LF_TIMER_COUNT3_ADDRESS 0x0000007c
#define LF_TIMER_COUNT3_OFFSET 0x0000007c
#define LF_TIMER_COUNT3_VALUE_MSB 31
#define LF_TIMER_COUNT3_VALUE_LSB 0
#define LF_TIMER_COUNT3_VALUE_MASK 0xffffffff
#define LF_TIMER_COUNT3_VALUE_GET(x) (((x)&LF_TIMER_COUNT3_VALUE_MASK) >> LF_TIMER_COUNT3_VALUE_LSB)
#define LF_TIMER_COUNT3_VALUE_SET(x) (((x) << LF_TIMER_COUNT3_VALUE_LSB) & LF_TIMER_COUNT3_VALUE_MASK)

#define LF_TIMER_CONTROL3_ADDRESS 0x00000080
#define LF_TIMER_CONTROL3_OFFSET 0x00000080
#define LF_TIMER_CONTROL3_ENABLE_MSB 2
#define LF_TIMER_CONTROL3_ENABLE_LSB 2
#define LF_TIMER_CONTROL3_ENABLE_MASK 0x00000004
#define LF_TIMER_CONTROL3_ENABLE_GET(x) (((x)&LF_TIMER_CONTROL3_ENABLE_MASK) >> LF_TIMER_CONTROL3_ENABLE_LSB)
#define LF_TIMER_CONTROL3_ENABLE_SET(x) (((x) << LF_TIMER_CONTROL3_ENABLE_LSB) & LF_TIMER_CONTROL3_ENABLE_MASK)
#define LF_TIMER_CONTROL3_AUTO_RESTART_MSB 1
#define LF_TIMER_CONTROL3_AUTO_RESTART_LSB 1
#define LF_TIMER_CONTROL3_AUTO_RESTART_MASK 0x00000002
#define LF_TIMER_CONTROL3_AUTO_RESTART_GET(x) \
    (((x)&LF_TIMER_CONTROL3_AUTO_RESTART_MASK) >> LF_TIMER_CONTROL3_AUTO_RESTART_LSB)
#define LF_TIMER_CONTROL3_AUTO_RESTART_SET(x) \
    (((x) << LF_TIMER_CONTROL3_AUTO_RESTART_LSB) & LF_TIMER_CONTROL3_AUTO_RESTART_MASK)
#define LF_TIMER_CONTROL3_RESET_MSB 0
#define LF_TIMER_CONTROL3_RESET_LSB 0
#define LF_TIMER_CONTROL3_RESET_MASK 0x00000001
#define LF_TIMER_CONTROL3_RESET_GET(x) (((x)&LF_TIMER_CONTROL3_RESET_MASK) >> LF_TIMER_CONTROL3_RESET_LSB)
#define LF_TIMER_CONTROL3_RESET_SET(x) (((x) << LF_TIMER_CONTROL3_RESET_LSB) & LF_TIMER_CONTROL3_RESET_MASK)

#define LF_TIMER_STATUS3_ADDRESS 0x00000084
#define LF_TIMER_STATUS3_OFFSET 0x00000084
#define LF_TIMER_STATUS3_INTERRUPT_MSB 0
#define LF_TIMER_STATUS3_INTERRUPT_LSB 0
#define LF_TIMER_STATUS3_INTERRUPT_MASK 0x00000001
#define LF_TIMER_STATUS3_INTERRUPT_GET(x) (((x)&LF_TIMER_STATUS3_INTERRUPT_MASK) >> LF_TIMER_STATUS3_INTERRUPT_LSB)
#define LF_TIMER_STATUS3_INTERRUPT_SET(x) (((x) << LF_TIMER_STATUS3_INTERRUPT_LSB) & LF_TIMER_STATUS3_INTERRUPT_MASK)

#define HF_TIMER_ADDRESS 0x00000088
#define HF_TIMER_OFFSET 0x00000088
#define HF_TIMER_TARGET_MSB 31
#define HF_TIMER_TARGET_LSB 12
#define HF_TIMER_TARGET_MASK 0xfffff000
#define HF_TIMER_TARGET_GET(x) (((x)&HF_TIMER_TARGET_MASK) >> HF_TIMER_TARGET_LSB)
#define HF_TIMER_TARGET_SET(x) (((x) << HF_TIMER_TARGET_LSB) & HF_TIMER_TARGET_MASK)

