alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw2.0/hw/hw20_rtc_reg.h
#define HF_TIMER_COUNT_ADDRESS 0x0000008c
#define HF_TIMER_COUNT_OFFSET 0x0000008c
#define HF_TIMER_COUNT_VALUE_MSB 31
#define HF_TIMER_COUNT_VALUE_LSB 12
#define HF_TIMER_COUNT_VALUE_MASK 0xfffff000
#define HF_TIMER_COUNT_VALUE_GET(x) (((x)&HF_TIMER_COUNT_VALUE_MASK) >> HF_TIMER_COUNT_VALUE_LSB)
#define HF_TIMER_COUNT_VALUE_SET(x) (((x) << HF_TIMER_COUNT_VALUE_LSB) & HF_TIMER_COUNT_VALUE_MASK)

#define HF_LF_COUNT_ADDRESS 0x00000090
#define HF_LF_COUNT_OFFSET 0x00000090
#define HF_LF_COUNT_VALUE_MSB 31
#define HF_LF_COUNT_VALUE_LSB 0
#define HF_LF_COUNT_VALUE_MASK 0xffffffff
#define HF_LF_COUNT_VALUE_GET(x) (((x)&HF_LF_COUNT_VALUE_MASK) >> HF_LF_COUNT_VALUE_LSB)
#define HF_LF_COUNT_VALUE_SET(x) (((x) << HF_LF_COUNT_VALUE_LSB) & HF_LF_COUNT_VALUE_MASK)

#define HF_TIMER_CONTROL_ADDRESS 0x00000094
#define HF_TIMER_CONTROL_OFFSET 0x00000094
#define HF_TIMER_CONTROL_ENABLE_MSB 3
#define HF_TIMER_CONTROL_ENABLE_LSB 3
#define HF_TIMER_CONTROL_ENABLE_MASK 0x00000008
#define HF_TIMER_CONTROL_ENABLE_GET(x) (((x)&HF_TIMER_CONTROL_ENABLE_MASK) >> HF_TIMER_CONTROL_ENABLE_LSB)
#define HF_TIMER_CONTROL_ENABLE_SET(x) (((x) << HF_TIMER_CONTROL_ENABLE_LSB) & HF_TIMER_CONTROL_ENABLE_MASK)
#define HF_TIMER_CONTROL_ON_MSB 2
#define HF_TIMER_CONTROL_ON_LSB 2
#define HF_TIMER_CONTROL_ON_MASK 0x00000004
#define HF_TIMER_CONTROL_ON_GET(x) (((x)&HF_TIMER_CONTROL_ON_MASK) >> HF_TIMER_CONTROL_ON_LSB)
#define HF_TIMER_CONTROL_ON_SET(x) (((x) << HF_TIMER_CONTROL_ON_LSB) & HF_TIMER_CONTROL_ON_MASK)
#define HF_TIMER_CONTROL_AUTO_RESTART_MSB 1
#define HF_TIMER_CONTROL_AUTO_RESTART_LSB 1
#define HF_TIMER_CONTROL_AUTO_RESTART_MASK 0x00000002
#define HF_TIMER_CONTROL_AUTO_RESTART_GET(x) \
    (((x)&HF_TIMER_CONTROL_AUTO_RESTART_MASK) >> HF_TIMER_CONTROL_AUTO_RESTART_LSB)
#define HF_TIMER_CONTROL_AUTO_RESTART_SET(x) \
    (((x) << HF_TIMER_CONTROL_AUTO_RESTART_LSB) & HF_TIMER_CONTROL_AUTO_RESTART_MASK)
#define HF_TIMER_CONTROL_RESET_MSB 0
#define HF_TIMER_CONTROL_RESET_LSB 0
#define HF_TIMER_CONTROL_RESET_MASK 0x00000001
#define HF_TIMER_CONTROL_RESET_GET(x) (((x)&HF_TIMER_CONTROL_RESET_MASK) >> HF_TIMER_CONTROL_RESET_LSB)
#define HF_TIMER_CONTROL_RESET_SET(x) (((x) << HF_TIMER_CONTROL_RESET_LSB) & HF_TIMER_CONTROL_RESET_MASK)

#define HF_TIMER_STATUS_ADDRESS 0x00000098
#define HF_TIMER_STATUS_OFFSET 0x00000098
#define HF_TIMER_STATUS_INTERRUPT_MSB 0
#define HF_TIMER_STATUS_INTERRUPT_LSB 0
#define HF_TIMER_STATUS_INTERRUPT_MASK 0x00000001
#define HF_TIMER_STATUS_INTERRUPT_GET(x) (((x)&HF_TIMER_STATUS_INTERRUPT_MASK) >> HF_TIMER_STATUS_INTERRUPT_LSB)
#define HF_TIMER_STATUS_INTERRUPT_SET(x) (((x) << HF_TIMER_STATUS_INTERRUPT_LSB) & HF_TIMER_STATUS_INTERRUPT_MASK)

#define RTC_CONTROL_ADDRESS 0x0000009c
#define RTC_CONTROL_OFFSET 0x0000009c
#define RTC_CONTROL_ENABLE_MSB 2
#define RTC_CONTROL_ENABLE_LSB 2
#define RTC_CONTROL_ENABLE_MASK 0x00000004
#define RTC_CONTROL_ENABLE_GET(x) (((x)&RTC_CONTROL_ENABLE_MASK) >> RTC_CONTROL_ENABLE_LSB)
#define RTC_CONTROL_ENABLE_SET(x) (((x) << RTC_CONTROL_ENABLE_LSB) & RTC_CONTROL_ENABLE_MASK)
#define RTC_CONTROL_LOAD_RTC_MSB 1
#define RTC_CONTROL_LOAD_RTC_LSB 1
#define RTC_CONTROL_LOAD_RTC_MASK 0x00000002
#define RTC_CONTROL_LOAD_RTC_GET(x) (((x)&RTC_CONTROL_LOAD_RTC_MASK) >> RTC_CONTROL_LOAD_RTC_LSB)
#define RTC_CONTROL_LOAD_RTC_SET(x) (((x) << RTC_CONTROL_LOAD_RTC_LSB) & RTC_CONTROL_LOAD_RTC_MASK)
#define RTC_CONTROL_LOAD_ALARM_MSB 0
#define RTC_CONTROL_LOAD_ALARM_LSB 0
#define RTC_CONTROL_LOAD_ALARM_MASK 0x00000001
#define RTC_CONTROL_LOAD_ALARM_GET(x) (((x)&RTC_CONTROL_LOAD_ALARM_MASK) >> RTC_CONTROL_LOAD_ALARM_LSB)
#define RTC_CONTROL_LOAD_ALARM_SET(x) (((x) << RTC_CONTROL_LOAD_ALARM_LSB) & RTC_CONTROL_LOAD_ALARM_MASK)

#define RTC_TIME_ADDRESS 0x000000a0
#define RTC_TIME_OFFSET 0x000000a0
#define RTC_TIME_WEEK_DAY_MSB 26
#define RTC_TIME_WEEK_DAY_LSB 24
#define RTC_TIME_WEEK_DAY_MASK 0x07000000
#define RTC_TIME_WEEK_DAY_GET(x) (((x)&RTC_TIME_WEEK_DAY_MASK) >> RTC_TIME_WEEK_DAY_LSB)
#define RTC_TIME_WEEK_DAY_SET(x) (((x) << RTC_TIME_WEEK_DAY_LSB) & RTC_TIME_WEEK_DAY_MASK)
#define RTC_TIME_HOUR_MSB 21
#define RTC_TIME_HOUR_LSB 16
#define RTC_TIME_HOUR_MASK 0x003f0000
#define RTC_TIME_HOUR_GET(x) (((x)&RTC_TIME_HOUR_MASK) >> RTC_TIME_HOUR_LSB)
#define RTC_TIME_HOUR_SET(x) (((x) << RTC_TIME_HOUR_LSB) & RTC_TIME_HOUR_MASK)
#define RTC_TIME_MINUTE_MSB 14
#define RTC_TIME_MINUTE_LSB 8
#define RTC_TIME_MINUTE_MASK 0x00007f00
#define RTC_TIME_MINUTE_GET(x) (((x)&RTC_TIME_MINUTE_MASK) >> RTC_TIME_MINUTE_LSB)
#define RTC_TIME_MINUTE_SET(x) (((x) << RTC_TIME_MINUTE_LSB) & RTC_TIME_MINUTE_MASK)
#define RTC_TIME_SECOND_MSB 6
#define RTC_TIME_SECOND_LSB 0
#define RTC_TIME_SECOND_MASK 0x0000007f
#define RTC_TIME_SECOND_GET(x) (((x)&RTC_TIME_SECOND_MASK) >> RTC_TIME_SECOND_LSB)
#define RTC_TIME_SECOND_SET(x) (((x) << RTC_TIME_SECOND_LSB) & RTC_TIME_SECOND_MASK)

#define RTC_DATE_ADDRESS 0x000000a4
#define RTC_DATE_OFFSET 0x000000a4
#define RTC_DATE_YEAR_MSB 23
#define RTC_DATE_YEAR_LSB 16
#define RTC_DATE_YEAR_MASK 0x00ff0000
#define RTC_DATE_YEAR_GET(x) (((x)&RTC_DATE_YEAR_MASK) >> RTC_DATE_YEAR_LSB)
#define RTC_DATE_YEAR_SET(x) (((x) << RTC_DATE_YEAR_LSB) & RTC_DATE_YEAR_MASK)
#define RTC_DATE_MONTH_MSB 12
#define RTC_DATE_MONTH_LSB 8
#define RTC_DATE_MONTH_MASK 0x00001f00
#define RTC_DATE_MONTH_GET(x) (((x)&RTC_DATE_MONTH_MASK) >> RTC_DATE_MONTH_LSB)
#define RTC_DATE_MONTH_SET(x) (((x) << RTC_DATE_MONTH_LSB) & RTC_DATE_MONTH_MASK)
#define RTC_DATE_MONTH_DAY_MSB 5
#define RTC_DATE_MONTH_DAY_LSB 0
#define RTC_DATE_MONTH_DAY_MASK 0x0000003f
#define RTC_DATE_MONTH_DAY_GET(x) (((x)&RTC_DATE_MONTH_DAY_MASK) >> RTC_DATE_MONTH_DAY_LSB)
#define RTC_DATE_MONTH_DAY_SET(x) (((x) << RTC_DATE_MONTH_DAY_LSB) & RTC_DATE_MONTH_DAY_MASK)

#define RTC_SET_TIME_ADDRESS 0x000000a8
#define RTC_SET_TIME_OFFSET 0x000000a8
#define RTC_SET_TIME_WEEK_DAY_MSB 26
#define RTC_SET_TIME_WEEK_DAY_LSB 24
#define RTC_SET_TIME_WEEK_DAY_MASK 0x07000000
#define RTC_SET_TIME_WEEK_DAY_GET(x) (((x)&RTC_SET_TIME_WEEK_DAY_MASK) >> RTC_SET_TIME_WEEK_DAY_LSB)
#define RTC_SET_TIME_WEEK_DAY_SET(x) (((x) << RTC_SET_TIME_WEEK_DAY_LSB) & RTC_SET_TIME_WEEK_DAY_MASK)
#define RTC_SET_TIME_HOUR_MSB 21
#define RTC_SET_TIME_HOUR_LSB 16
#define RTC_SET_TIME_HOUR_MASK 0x003f0000
#define RTC_SET_TIME_HOUR_GET(x) (((x)&RTC_SET_TIME_HOUR_MASK) >> RTC_SET_TIME_HOUR_LSB)
#define RTC_SET_TIME_HOUR_SET(x) (((x) << RTC_SET_TIME_HOUR_LSB) & RTC_SET_TIME_HOUR_MASK)
#define RTC_SET_TIME_MINUTE_MSB 14
#define RTC_SET_TIME_MINUTE_LSB 8
#define RTC_SET_TIME_MINUTE_MASK 0x00007f00
#define RTC_SET_TIME_MINUTE_GET(x) (((x)&RTC_SET_TIME_MINUTE_MASK) >> RTC_SET_TIME_MINUTE_LSB)
#define RTC_SET_TIME_MINUTE_SET(x) (((x) << RTC_SET_TIME_MINUTE_LSB) & RTC_SET_TIME_MINUTE_MASK)
#define RTC_SET_TIME_SECOND_MSB 6
#define RTC_SET_TIME_SECOND_LSB 0
#define RTC_SET_TIME_SECOND_MASK 0x0000007f
#define RTC_SET_TIME_SECOND_GET(x) (((x)&RTC_SET_TIME_SECOND_MASK) >> RTC_SET_TIME_SECOND_LSB)
#define RTC_SET_TIME_SECOND_SET(x) (((x) << RTC_SET_TIME_SECOND_LSB) & RTC_SET_TIME_SECOND_MASK)

#define RTC_SET_DATE_ADDRESS 0x000000ac
#define RTC_SET_DATE_OFFSET 0x000000ac
#define RTC_SET_DATE_YEAR_MSB 23
#define RTC_SET_DATE_YEAR_LSB 16
#define RTC_SET_DATE_YEAR_MASK 0x00ff0000
#define RTC_SET_DATE_YEAR_GET(x) (((x)&RTC_SET_DATE_YEAR_MASK) >> RTC_SET_DATE_YEAR_LSB)
#define RTC_SET_DATE_YEAR_SET(x) (((x) << RTC_SET_DATE_YEAR_LSB) & RTC_SET_DATE_YEAR_MASK)
#define RTC_SET_DATE_MONTH_MSB 12
#define RTC_SET_DATE_MONTH_LSB 8
#define RTC_SET_DATE_MONTH_MASK 0x00001f00
#define RTC_SET_DATE_MONTH_GET(x) (((x)&RTC_SET_DATE_MONTH_MASK) >> RTC_SET_DATE_MONTH_LSB)
#define RTC_SET_DATE_MONTH_SET(x) (((x) << RTC_SET_DATE_MONTH_LSB) & RTC_SET_DATE_MONTH_MASK)
#define RTC_SET_DATE_MONTH_DAY_MSB 5
#define RTC_SET_DATE_MONTH_DAY_LSB 0
#define RTC_SET_DATE_MONTH_DAY_MASK 0x0000003f
#define RTC_SET_DATE_MONTH_DAY_GET(x) (((x)&RTC_SET_DATE_MONTH_DAY_MASK) >> RTC_SET_DATE_MONTH_DAY_LSB)
#define RTC_SET_DATE_MONTH_DAY_SET(x) (((x) << RTC_SET_DATE_MONTH_DAY_LSB) & RTC_SET_DATE_MONTH_DAY_MASK)

