alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw2.0/hw/hw20_rtc_reg.h
#define RTC_SET_ALARM_ADDRESS 0x000000b0
#define RTC_SET_ALARM_OFFSET 0x000000b0
#define RTC_SET_ALARM_HOUR_MSB 21
#define RTC_SET_ALARM_HOUR_LSB 16
#define RTC_SET_ALARM_HOUR_MASK 0x003f0000
#define RTC_SET_ALARM_HOUR_GET(x) (((x)&RTC_SET_ALARM_HOUR_MASK) >> RTC_SET_ALARM_HOUR_LSB)
#define RTC_SET_ALARM_HOUR_SET(x) (((x) << RTC_SET_ALARM_HOUR_LSB) & RTC_SET_ALARM_HOUR_MASK)
#define RTC_SET_ALARM_MINUTE_MSB 14
#define RTC_SET_ALARM_MINUTE_LSB 8
#define RTC_SET_ALARM_MINUTE_MASK 0x00007f00
#define RTC_SET_ALARM_MINUTE_GET(x) (((x)&RTC_SET_ALARM_MINUTE_MASK) >> RTC_SET_ALARM_MINUTE_LSB)
#define RTC_SET_ALARM_MINUTE_SET(x) (((x) << RTC_SET_ALARM_MINUTE_LSB) & RTC_SET_ALARM_MINUTE_MASK)
#define RTC_SET_ALARM_SECOND_MSB 6
#define RTC_SET_ALARM_SECOND_LSB 0
#define RTC_SET_ALARM_SECOND_MASK 0x0000007f
#define RTC_SET_ALARM_SECOND_GET(x) (((x)&RTC_SET_ALARM_SECOND_MASK) >> RTC_SET_ALARM_SECOND_LSB)
#define RTC_SET_ALARM_SECOND_SET(x) (((x) << RTC_SET_ALARM_SECOND_LSB) & RTC_SET_ALARM_SECOND_MASK)

#define RTC_CONFIG_ADDRESS 0x000000b4
#define RTC_CONFIG_OFFSET 0x000000b4
#define RTC_CONFIG_BCD_MSB 2
#define RTC_CONFIG_BCD_LSB 2
#define RTC_CONFIG_BCD_MASK 0x00000004
#define RTC_CONFIG_BCD_GET(x) (((x)&RTC_CONFIG_BCD_MASK) >> RTC_CONFIG_BCD_LSB)
#define RTC_CONFIG_BCD_SET(x) (((x) << RTC_CONFIG_BCD_LSB) & RTC_CONFIG_BCD_MASK)
#define RTC_CONFIG_TWELVE_HOUR_MSB 1
#define RTC_CONFIG_TWELVE_HOUR_LSB 1
#define RTC_CONFIG_TWELVE_HOUR_MASK 0x00000002
#define RTC_CONFIG_TWELVE_HOUR_GET(x) (((x)&RTC_CONFIG_TWELVE_HOUR_MASK) >> RTC_CONFIG_TWELVE_HOUR_LSB)
#define RTC_CONFIG_TWELVE_HOUR_SET(x) (((x) << RTC_CONFIG_TWELVE_HOUR_LSB) & RTC_CONFIG_TWELVE_HOUR_MASK)
#define RTC_CONFIG_DSE_MSB 0
#define RTC_CONFIG_DSE_LSB 0
#define RTC_CONFIG_DSE_MASK 0x00000001
#define RTC_CONFIG_DSE_GET(x) (((x)&RTC_CONFIG_DSE_MASK) >> RTC_CONFIG_DSE_LSB)
#define RTC_CONFIG_DSE_SET(x) (((x) << RTC_CONFIG_DSE_LSB) & RTC_CONFIG_DSE_MASK)

#define RTC_ALARM_STATUS_ADDRESS 0x000000b8
#define RTC_ALARM_STATUS_OFFSET 0x000000b8
#define RTC_ALARM_STATUS_ENABLE_MSB 1
#define RTC_ALARM_STATUS_ENABLE_LSB 1
#define RTC_ALARM_STATUS_ENABLE_MASK 0x00000002
#define RTC_ALARM_STATUS_ENABLE_GET(x) (((x)&RTC_ALARM_STATUS_ENABLE_MASK) >> RTC_ALARM_STATUS_ENABLE_LSB)
#define RTC_ALARM_STATUS_ENABLE_SET(x) (((x) << RTC_ALARM_STATUS_ENABLE_LSB) & RTC_ALARM_STATUS_ENABLE_MASK)
#define RTC_ALARM_STATUS_INTERRUPT_MSB 0
#define RTC_ALARM_STATUS_INTERRUPT_LSB 0
#define RTC_ALARM_STATUS_INTERRUPT_MASK 0x00000001
#define RTC_ALARM_STATUS_INTERRUPT_GET(x) (((x)&RTC_ALARM_STATUS_INTERRUPT_MASK) >> RTC_ALARM_STATUS_INTERRUPT_LSB)
#define RTC_ALARM_STATUS_INTERRUPT_SET(x) (((x) << RTC_ALARM_STATUS_INTERRUPT_LSB) & RTC_ALARM_STATUS_INTERRUPT_MASK)

#define UART_WAKEUP_ADDRESS 0x000000bc
#define UART_WAKEUP_OFFSET 0x000000bc
#define UART_WAKEUP_ENABLE_MSB 0
#define UART_WAKEUP_ENABLE_LSB 0
#define UART_WAKEUP_ENABLE_MASK 0x00000001
#define UART_WAKEUP_ENABLE_GET(x) (((x)&UART_WAKEUP_ENABLE_MASK) >> UART_WAKEUP_ENABLE_LSB)
#define UART_WAKEUP_ENABLE_SET(x) (((x) << UART_WAKEUP_ENABLE_LSB) & UART_WAKEUP_ENABLE_MASK)

#define RESET_CAUSE_ADDRESS 0x000000c0
#define RESET_CAUSE_OFFSET 0x000000c0
#define RESET_CAUSE_LAST_MSB 2
#define RESET_CAUSE_LAST_LSB 0
#define RESET_CAUSE_LAST_MASK 0x00000007
#define RESET_CAUSE_LAST_GET(x) (((x)&RESET_CAUSE_LAST_MASK) >> RESET_CAUSE_LAST_LSB)
#define RESET_CAUSE_LAST_SET(x) (((x) << RESET_CAUSE_LAST_LSB) & RESET_CAUSE_LAST_MASK)

#define SYSTEM_SLEEP_ADDRESS 0x000000c4
#define SYSTEM_SLEEP_OFFSET 0x000000c4
#define SYSTEM_SLEEP_HOST_IF_MSB 4
#define SYSTEM_SLEEP_HOST_IF_LSB 4
#define SYSTEM_SLEEP_HOST_IF_MASK 0x00000010
#define SYSTEM_SLEEP_HOST_IF_GET(x) (((x)&SYSTEM_SLEEP_HOST_IF_MASK) >> SYSTEM_SLEEP_HOST_IF_LSB)
#define SYSTEM_SLEEP_HOST_IF_SET(x) (((x) << SYSTEM_SLEEP_HOST_IF_LSB) & SYSTEM_SLEEP_HOST_IF_MASK)
#define SYSTEM_SLEEP_MBOX_MSB 3
#define SYSTEM_SLEEP_MBOX_LSB 3
#define SYSTEM_SLEEP_MBOX_MASK 0x00000008
#define SYSTEM_SLEEP_MBOX_GET(x) (((x)&SYSTEM_SLEEP_MBOX_MASK) >> SYSTEM_SLEEP_MBOX_LSB)
#define SYSTEM_SLEEP_MBOX_SET(x) (((x) << SYSTEM_SLEEP_MBOX_LSB) & SYSTEM_SLEEP_MBOX_MASK)
#define SYSTEM_SLEEP_MAC_IF_MSB 2
#define SYSTEM_SLEEP_MAC_IF_LSB 2
#define SYSTEM_SLEEP_MAC_IF_MASK 0x00000004
#define SYSTEM_SLEEP_MAC_IF_GET(x) (((x)&SYSTEM_SLEEP_MAC_IF_MASK) >> SYSTEM_SLEEP_MAC_IF_LSB)
#define SYSTEM_SLEEP_MAC_IF_SET(x) (((x) << SYSTEM_SLEEP_MAC_IF_LSB) & SYSTEM_SLEEP_MAC_IF_MASK)
#define SYSTEM_SLEEP_LIGHT_MSB 1
#define SYSTEM_SLEEP_LIGHT_LSB 1
#define SYSTEM_SLEEP_LIGHT_MASK 0x00000002
#define SYSTEM_SLEEP_LIGHT_GET(x) (((x)&SYSTEM_SLEEP_LIGHT_MASK) >> SYSTEM_SLEEP_LIGHT_LSB)
#define SYSTEM_SLEEP_LIGHT_SET(x) (((x) << SYSTEM_SLEEP_LIGHT_LSB) & SYSTEM_SLEEP_LIGHT_MASK)
#define SYSTEM_SLEEP_DISABLE_MSB 0
#define SYSTEM_SLEEP_DISABLE_LSB 0
#define SYSTEM_SLEEP_DISABLE_MASK 0x00000001
#define SYSTEM_SLEEP_DISABLE_GET(x) (((x)&SYSTEM_SLEEP_DISABLE_MASK) >> SYSTEM_SLEEP_DISABLE_LSB)
#define SYSTEM_SLEEP_DISABLE_SET(x) (((x) << SYSTEM_SLEEP_DISABLE_LSB) & SYSTEM_SLEEP_DISABLE_MASK)

#define SDIO_WRAPPER_ADDRESS 0x000000c8
#define SDIO_WRAPPER_OFFSET 0x000000c8
#define SDIO_WRAPPER_SLEEP_MSB 3
#define SDIO_WRAPPER_SLEEP_LSB 3
#define SDIO_WRAPPER_SLEEP_MASK 0x00000008
#define SDIO_WRAPPER_SLEEP_GET(x) (((x)&SDIO_WRAPPER_SLEEP_MASK) >> SDIO_WRAPPER_SLEEP_LSB)
#define SDIO_WRAPPER_SLEEP_SET(x) (((x) << SDIO_WRAPPER_SLEEP_LSB) & SDIO_WRAPPER_SLEEP_MASK)
#define SDIO_WRAPPER_WAKEUP_MSB 2
#define SDIO_WRAPPER_WAKEUP_LSB 2
#define SDIO_WRAPPER_WAKEUP_MASK 0x00000004
#define SDIO_WRAPPER_WAKEUP_GET(x) (((x)&SDIO_WRAPPER_WAKEUP_MASK) >> SDIO_WRAPPER_WAKEUP_LSB)
#define SDIO_WRAPPER_WAKEUP_SET(x) (((x) << SDIO_WRAPPER_WAKEUP_LSB) & SDIO_WRAPPER_WAKEUP_MASK)
#define SDIO_WRAPPER_SOC_ON_MSB 1
#define SDIO_WRAPPER_SOC_ON_LSB 1
#define SDIO_WRAPPER_SOC_ON_MASK 0x00000002
#define SDIO_WRAPPER_SOC_ON_GET(x) (((x)&SDIO_WRAPPER_SOC_ON_MASK) >> SDIO_WRAPPER_SOC_ON_LSB)
#define SDIO_WRAPPER_SOC_ON_SET(x) (((x) << SDIO_WRAPPER_SOC_ON_LSB) & SDIO_WRAPPER_SOC_ON_MASK)
#define SDIO_WRAPPER_ON_MSB 0
#define SDIO_WRAPPER_ON_LSB 0
#define SDIO_WRAPPER_ON_MASK 0x00000001
#define SDIO_WRAPPER_ON_GET(x) (((x)&SDIO_WRAPPER_ON_MASK) >> SDIO_WRAPPER_ON_LSB)
#define SDIO_WRAPPER_ON_SET(x) (((x) << SDIO_WRAPPER_ON_LSB) & SDIO_WRAPPER_ON_MASK)

#define MAC_SLEEP_CONTROL_ADDRESS 0x000000cc
#define MAC_SLEEP_CONTROL_OFFSET 0x000000cc
#define MAC_SLEEP_CONTROL_ENABLE_MSB 1
#define MAC_SLEEP_CONTROL_ENABLE_LSB 0
#define MAC_SLEEP_CONTROL_ENABLE_MASK 0x00000003
#define MAC_SLEEP_CONTROL_ENABLE_GET(x) (((x)&MAC_SLEEP_CONTROL_ENABLE_MASK) >> MAC_SLEEP_CONTROL_ENABLE_LSB)
#define MAC_SLEEP_CONTROL_ENABLE_SET(x) (((x) << MAC_SLEEP_CONTROL_ENABLE_LSB) & MAC_SLEEP_CONTROL_ENABLE_MASK)

