alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw2.0/hw/hw20_rtc_reg.h
#define KEEP_AWAKE_ADDRESS 0x000000d0
#define KEEP_AWAKE_OFFSET 0x000000d0
#define KEEP_AWAKE_COUNT_MSB 7
#define KEEP_AWAKE_COUNT_LSB 0
#define KEEP_AWAKE_COUNT_MASK 0x000000ff
#define KEEP_AWAKE_COUNT_GET(x) (((x)&KEEP_AWAKE_COUNT_MASK) >> KEEP_AWAKE_COUNT_LSB)
#define KEEP_AWAKE_COUNT_SET(x) (((x) << KEEP_AWAKE_COUNT_LSB) & KEEP_AWAKE_COUNT_MASK)

#define LPO_CAL_TIME_ADDRESS 0x000000d4
#define LPO_CAL_TIME_OFFSET 0x000000d4
#define LPO_CAL_TIME_LENGTH_MSB 13
#define LPO_CAL_TIME_LENGTH_LSB 0
#define LPO_CAL_TIME_LENGTH_MASK 0x00003fff
#define LPO_CAL_TIME_LENGTH_GET(x) (((x)&LPO_CAL_TIME_LENGTH_MASK) >> LPO_CAL_TIME_LENGTH_LSB)
#define LPO_CAL_TIME_LENGTH_SET(x) (((x) << LPO_CAL_TIME_LENGTH_LSB) & LPO_CAL_TIME_LENGTH_MASK)

#define LPO_INIT_DIVIDEND_INT_ADDRESS 0x000000d8
#define LPO_INIT_DIVIDEND_INT_OFFSET 0x000000d8
#define LPO_INIT_DIVIDEND_INT_VALUE_MSB 23
#define LPO_INIT_DIVIDEND_INT_VALUE_LSB 0
#define LPO_INIT_DIVIDEND_INT_VALUE_MASK 0x00ffffff
#define LPO_INIT_DIVIDEND_INT_VALUE_GET(x) (((x)&LPO_INIT_DIVIDEND_INT_VALUE_MASK) >> LPO_INIT_DIVIDEND_INT_VALUE_LSB)
#define LPO_INIT_DIVIDEND_INT_VALUE_SET(x) (((x) << LPO_INIT_DIVIDEND_INT_VALUE_LSB) & LPO_INIT_DIVIDEND_INT_VALUE_MASK)

#define LPO_INIT_DIVIDEND_FRACTION_ADDRESS 0x000000dc
#define LPO_INIT_DIVIDEND_FRACTION_OFFSET 0x000000dc
#define LPO_INIT_DIVIDEND_FRACTION_VALUE_MSB 10
#define LPO_INIT_DIVIDEND_FRACTION_VALUE_LSB 0
#define LPO_INIT_DIVIDEND_FRACTION_VALUE_MASK 0x000007ff
#define LPO_INIT_DIVIDEND_FRACTION_VALUE_GET(x) \
    (((x)&LPO_INIT_DIVIDEND_FRACTION_VALUE_MASK) >> LPO_INIT_DIVIDEND_FRACTION_VALUE_LSB)
#define LPO_INIT_DIVIDEND_FRACTION_VALUE_SET(x) \
    (((x) << LPO_INIT_DIVIDEND_FRACTION_VALUE_LSB) & LPO_INIT_DIVIDEND_FRACTION_VALUE_MASK)

#define LPO_CAL_ADDRESS 0x000000e0
#define LPO_CAL_OFFSET 0x000000e0
#define LPO_CAL_ENABLE_MSB 20
#define LPO_CAL_ENABLE_LSB 20
#define LPO_CAL_ENABLE_MASK 0x00100000
#define LPO_CAL_ENABLE_GET(x) (((x)&LPO_CAL_ENABLE_MASK) >> LPO_CAL_ENABLE_LSB)
#define LPO_CAL_ENABLE_SET(x) (((x) << LPO_CAL_ENABLE_LSB) & LPO_CAL_ENABLE_MASK)
#define LPO_CAL_COUNT_MSB 19
#define LPO_CAL_COUNT_LSB 0
#define LPO_CAL_COUNT_MASK 0x000fffff
#define LPO_CAL_COUNT_GET(x) (((x)&LPO_CAL_COUNT_MASK) >> LPO_CAL_COUNT_LSB)
#define LPO_CAL_COUNT_SET(x) (((x) << LPO_CAL_COUNT_LSB) & LPO_CAL_COUNT_MASK)

#define LPO_CAL_TEST_CONTROL_ADDRESS 0x000000e4
#define LPO_CAL_TEST_CONTROL_OFFSET 0x000000e4
#define LPO_CAL_TEST_CONTROL_ENABLE_MSB 5
#define LPO_CAL_TEST_CONTROL_ENABLE_LSB 5
#define LPO_CAL_TEST_CONTROL_ENABLE_MASK 0x00000020
#define LPO_CAL_TEST_CONTROL_ENABLE_GET(x) (((x)&LPO_CAL_TEST_CONTROL_ENABLE_MASK) >> LPO_CAL_TEST_CONTROL_ENABLE_LSB)
#define LPO_CAL_TEST_CONTROL_ENABLE_SET(x) (((x) << LPO_CAL_TEST_CONTROL_ENABLE_LSB) & LPO_CAL_TEST_CONTROL_ENABLE_MASK)
#define LPO_CAL_TEST_CONTROL_RTC_CYCLES_MSB 4
#define LPO_CAL_TEST_CONTROL_RTC_CYCLES_LSB 0
#define LPO_CAL_TEST_CONTROL_RTC_CYCLES_MASK 0x0000001f
#define LPO_CAL_TEST_CONTROL_RTC_CYCLES_GET(x) \
    (((x)&LPO_CAL_TEST_CONTROL_RTC_CYCLES_MASK) >> LPO_CAL_TEST_CONTROL_RTC_CYCLES_LSB)
#define LPO_CAL_TEST_CONTROL_RTC_CYCLES_SET(x) \
    (((x) << LPO_CAL_TEST_CONTROL_RTC_CYCLES_LSB) & LPO_CAL_TEST_CONTROL_RTC_CYCLES_MASK)

#define LPO_CAL_TEST_STATUS_ADDRESS 0x000000e8
#define LPO_CAL_TEST_STATUS_OFFSET 0x000000e8
#define LPO_CAL_TEST_STATUS_READY_MSB 16
#define LPO_CAL_TEST_STATUS_READY_LSB 16
#define LPO_CAL_TEST_STATUS_READY_MASK 0x00010000
#define LPO_CAL_TEST_STATUS_READY_GET(x) (((x)&LPO_CAL_TEST_STATUS_READY_MASK) >> LPO_CAL_TEST_STATUS_READY_LSB)
#define LPO_CAL_TEST_STATUS_READY_SET(x) (((x) << LPO_CAL_TEST_STATUS_READY_LSB) & LPO_CAL_TEST_STATUS_READY_MASK)
#define LPO_CAL_TEST_STATUS_COUNT_MSB 15
#define LPO_CAL_TEST_STATUS_COUNT_LSB 0
#define LPO_CAL_TEST_STATUS_COUNT_MASK 0x0000ffff
#define LPO_CAL_TEST_STATUS_COUNT_GET(x) (((x)&LPO_CAL_TEST_STATUS_COUNT_MASK) >> LPO_CAL_TEST_STATUS_COUNT_LSB)
#define LPO_CAL_TEST_STATUS_COUNT_SET(x) (((x) << LPO_CAL_TEST_STATUS_COUNT_LSB) & LPO_CAL_TEST_STATUS_COUNT_MASK)

#define CHIP_ID_ADDRESS 0x000000ec
#define CHIP_ID_OFFSET 0x000000ec
#define CHIP_ID_DEVICE_ID_MSB 31
#define CHIP_ID_DEVICE_ID_LSB 16
#define CHIP_ID_DEVICE_ID_MASK 0xffff0000
#define CHIP_ID_DEVICE_ID_GET(x) (((x)&CHIP_ID_DEVICE_ID_MASK) >> CHIP_ID_DEVICE_ID_LSB)
#define CHIP_ID_DEVICE_ID_SET(x) (((x) << CHIP_ID_DEVICE_ID_LSB) & CHIP_ID_DEVICE_ID_MASK)
#define CHIP_ID_CONFIG_ID_MSB 15
#define CHIP_ID_CONFIG_ID_LSB 4
#define CHIP_ID_CONFIG_ID_MASK 0x0000fff0
#define CHIP_ID_CONFIG_ID_GET(x) (((x)&CHIP_ID_CONFIG_ID_MASK) >> CHIP_ID_CONFIG_ID_LSB)
#define CHIP_ID_CONFIG_ID_SET(x) (((x) << CHIP_ID_CONFIG_ID_LSB) & CHIP_ID_CONFIG_ID_MASK)
#define CHIP_ID_VERSION_ID_MSB 3
#define CHIP_ID_VERSION_ID_LSB 0
#define CHIP_ID_VERSION_ID_MASK 0x0000000f
#define CHIP_ID_VERSION_ID_GET(x) (((x)&CHIP_ID_VERSION_ID_MASK) >> CHIP_ID_VERSION_ID_LSB)
#define CHIP_ID_VERSION_ID_SET(x) (((x) << CHIP_ID_VERSION_ID_LSB) & CHIP_ID_VERSION_ID_MASK)

#define DERIVED_RTC_CLK_ADDRESS 0x000000f0
#define DERIVED_RTC_CLK_OFFSET 0x000000f0
#define DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_MSB 20
#define DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_LSB 20
#define DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_MASK 0x00100000
#define DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_GET(x) \
    (((x)&DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_MASK) >> DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_LSB)
#define DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_SET(x) \
    (((x) << DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_LSB) & DERIVED_RTC_CLK_EXTERNAL_DETECT_EN_MASK)
#define DERIVED_RTC_CLK_EXTERNAL_DETECT_MSB 18
#define DERIVED_RTC_CLK_EXTERNAL_DETECT_LSB 18
#define DERIVED_RTC_CLK_EXTERNAL_DETECT_MASK 0x00040000
#define DERIVED_RTC_CLK_EXTERNAL_DETECT_GET(x) \
    (((x)&DERIVED_RTC_CLK_EXTERNAL_DETECT_MASK) >> DERIVED_RTC_CLK_EXTERNAL_DETECT_LSB)
#define DERIVED_RTC_CLK_EXTERNAL_DETECT_SET(x) \
    (((x) << DERIVED_RTC_CLK_EXTERNAL_DETECT_LSB) & DERIVED_RTC_CLK_EXTERNAL_DETECT_MASK)
#define DERIVED_RTC_CLK_FORCE_MSB 17
#define DERIVED_RTC_CLK_FORCE_LSB 16
#define DERIVED_RTC_CLK_FORCE_MASK 0x00030000
#define DERIVED_RTC_CLK_FORCE_GET(x) (((x)&DERIVED_RTC_CLK_FORCE_MASK) >> DERIVED_RTC_CLK_FORCE_LSB)
#define DERIVED_RTC_CLK_FORCE_SET(x) (((x) << DERIVED_RTC_CLK_FORCE_LSB) & DERIVED_RTC_CLK_FORCE_MASK)
#define DERIVED_RTC_CLK_PERIOD_MSB 15
#define DERIVED_RTC_CLK_PERIOD_LSB 1
#define DERIVED_RTC_CLK_PERIOD_MASK 0x0000fffe
#define DERIVED_RTC_CLK_PERIOD_GET(x) (((x)&DERIVED_RTC_CLK_PERIOD_MASK) >> DERIVED_RTC_CLK_PERIOD_LSB)
#define DERIVED_RTC_CLK_PERIOD_SET(x) (((x) << DERIVED_RTC_CLK_PERIOD_LSB) & DERIVED_RTC_CLK_PERIOD_MASK)

#define MAC_PCU_SLP32_MODE_ADDRESS 0x000000f4
#define MAC_PCU_SLP32_MODE_OFFSET 0x000000f4
#define MAC_PCU_SLP32_MODE_TSF_WRITE_PENDING_MSB 21
#define MAC_PCU_SLP32_MODE_TSF_WRITE_PENDING_LSB 21
#define MAC_PCU_SLP32_MODE_TSF_WRITE_PENDING_MASK 0x00200000
#define MAC_PCU_SLP32_MODE_TSF_WRITE_PENDING_GET(x) \
    (((x)&MAC_PCU_SLP32_MODE_TSF_WRITE_PENDING_MASK) >> MAC_PCU_SLP32_MODE_TSF_WRITE_PENDING_LSB)
#define MAC_PCU_SLP32_MODE_TSF_WRITE_PENDING_SET(x) \
    (((x) << MAC_PCU_SLP32_MODE_TSF_WRITE_PENDING_LSB) & MAC_PCU_SLP32_MODE_TSF_WRITE_PENDING_MASK)
#define MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_MSB 19
#define MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_LSB 0
#define MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_MASK 0x000fffff
#define MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_GET(x) \
    (((x)&MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_MASK) >> MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_LSB)
#define MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_SET(x) \
    (((x) << MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_LSB) & MAC_PCU_SLP32_MODE_HALF_CLK_LATENCY_MASK)

#define MAC_PCU_SLP32_WAKE_ADDRESS 0x000000f8
#define MAC_PCU_SLP32_WAKE_OFFSET 0x000000f8
#define MAC_PCU_SLP32_WAKE_XTL_TIME_MSB 15
#define MAC_PCU_SLP32_WAKE_XTL_TIME_LSB 0
#define MAC_PCU_SLP32_WAKE_XTL_TIME_MASK 0x0000ffff
#define MAC_PCU_SLP32_WAKE_XTL_TIME_GET(x) (((x)&MAC_PCU_SLP32_WAKE_XTL_TIME_MASK) >> MAC_PCU_SLP32_WAKE_XTL_TIME_LSB)
#define MAC_PCU_SLP32_WAKE_XTL_TIME_SET(x) (((x) << MAC_PCU_SLP32_WAKE_XTL_TIME_LSB) & MAC_PCU_SLP32_WAKE_XTL_TIME_MASK)

#define MAC_PCU_SLP32_INC_ADDRESS 0x000000fc
#define MAC_PCU_SLP32_INC_OFFSET 0x000000fc
#define MAC_PCU_SLP32_INC_TSF_INC_MSB 19
#define MAC_PCU_SLP32_INC_TSF_INC_LSB 0
#define MAC_PCU_SLP32_INC_TSF_INC_MASK 0x000fffff
#define MAC_PCU_SLP32_INC_TSF_INC_GET(x) (((x)&MAC_PCU_SLP32_INC_TSF_INC_MASK) >> MAC_PCU_SLP32_INC_TSF_INC_LSB)
#define MAC_PCU_SLP32_INC_TSF_INC_SET(x) (((x) << MAC_PCU_SLP32_INC_TSF_INC_LSB) & MAC_PCU_SLP32_INC_TSF_INC_MASK)

#define MAC_PCU_SLP_MIB1_ADDRESS 0x00000100
#define MAC_PCU_SLP_MIB1_OFFSET 0x00000100
#define MAC_PCU_SLP_MIB1_SLEEP_CNT_MSB 31
#define MAC_PCU_SLP_MIB1_SLEEP_CNT_LSB 0
#define MAC_PCU_SLP_MIB1_SLEEP_CNT_MASK 0xffffffff
#define MAC_PCU_SLP_MIB1_SLEEP_CNT_GET(x) (((x)&MAC_PCU_SLP_MIB1_SLEEP_CNT_MASK) >> MAC_PCU_SLP_MIB1_SLEEP_CNT_LSB)
#define MAC_PCU_SLP_MIB1_SLEEP_CNT_SET(x) (((x) << MAC_PCU_SLP_MIB1_SLEEP_CNT_LSB) & MAC_PCU_SLP_MIB1_SLEEP_CNT_MASK)

#define MAC_PCU_SLP_MIB2_ADDRESS 0x00000104
#define MAC_PCU_SLP_MIB2_OFFSET 0x00000104
#define MAC_PCU_SLP_MIB2_CYCLE_CNT_MSB 31
#define MAC_PCU_SLP_MIB2_CYCLE_CNT_LSB 0
#define MAC_PCU_SLP_MIB2_CYCLE_CNT_MASK 0xffffffff
#define MAC_PCU_SLP_MIB2_CYCLE_CNT_GET(x) (((x)&MAC_PCU_SLP_MIB2_CYCLE_CNT_MASK) >> MAC_PCU_SLP_MIB2_CYCLE_CNT_LSB)
#define MAC_PCU_SLP_MIB2_CYCLE_CNT_SET(x) (((x) << MAC_PCU_SLP_MIB2_CYCLE_CNT_LSB) & MAC_PCU_SLP_MIB2_CYCLE_CNT_MASK)

#define MAC_PCU_SLP_MIB3_ADDRESS 0x00000108
#define MAC_PCU_SLP_MIB3_OFFSET 0x00000108
#define MAC_PCU_SLP_MIB3_PENDING_MSB 1
#define MAC_PCU_SLP_MIB3_PENDING_LSB 1
#define MAC_PCU_SLP_MIB3_PENDING_MASK 0x00000002
#define MAC_PCU_SLP_MIB3_PENDING_GET(x) (((x)&MAC_PCU_SLP_MIB3_PENDING_MASK) >> MAC_PCU_SLP_MIB3_PENDING_LSB)
#define MAC_PCU_SLP_MIB3_PENDING_SET(x) (((x) << MAC_PCU_SLP_MIB3_PENDING_LSB) & MAC_PCU_SLP_MIB3_PENDING_MASK)
#define MAC_PCU_SLP_MIB3_CLR_CNT_MSB 0
#define MAC_PCU_SLP_MIB3_CLR_CNT_LSB 0
#define MAC_PCU_SLP_MIB3_CLR_CNT_MASK 0x00000001
#define MAC_PCU_SLP_MIB3_CLR_CNT_GET(x) (((x)&MAC_PCU_SLP_MIB3_CLR_CNT_MASK) >> MAC_PCU_SLP_MIB3_CLR_CNT_LSB)
#define MAC_PCU_SLP_MIB3_CLR_CNT_SET(x) (((x) << MAC_PCU_SLP_MIB3_CLR_CNT_LSB) & MAC_PCU_SLP_MIB3_CLR_CNT_MASK)

#define MAC_PCU_SLP_BEACON_ADDRESS 0x0000010c
#define MAC_PCU_SLP_BEACON_OFFSET 0x0000010c
#define MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_ENABLE_MSB 24
#define MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_ENABLE_LSB 24
#define MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_ENABLE_MASK 0x01000000
#define MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_ENABLE_GET(x) \
    (((x)&MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_ENABLE_MASK) >> MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_ENABLE_LSB)
#define MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_ENABLE_SET(x) \
    (((x) << MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_ENABLE_LSB) & MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_ENABLE_MASK)
#define MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_MSB 23
#define MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_LSB 0
#define MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_MASK 0x00ffffff
#define MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_GET(x) \
    (((x)&MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_MASK) >> MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_LSB)
#define MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_SET(x) \
    (((x) << MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_LSB) & MAC_PCU_SLP_BEACON_BMISS_TIMEOUT_MASK)

