alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw2.0/hw/hw20_rtc_reg.h
#define POWER_REG_ADDRESS 0x00000110
#define POWER_REG_OFFSET 0x00000110
#define POWER_REG_VLVL_MSB 11
#define POWER_REG_VLVL_LSB 8
#define POWER_REG_VLVL_MASK 0x00000f00
#define POWER_REG_VLVL_GET(x) (((x)&POWER_REG_VLVL_MASK) >> POWER_REG_VLVL_LSB)
#define POWER_REG_VLVL_SET(x) (((x) << POWER_REG_VLVL_LSB) & POWER_REG_VLVL_MASK)
#define POWER_REG_CPU_INT_ENABLE_MSB 7
#define POWER_REG_CPU_INT_ENABLE_LSB 7
#define POWER_REG_CPU_INT_ENABLE_MASK 0x00000080
#define POWER_REG_CPU_INT_ENABLE_GET(x) (((x)&POWER_REG_CPU_INT_ENABLE_MASK) >> POWER_REG_CPU_INT_ENABLE_LSB)
#define POWER_REG_CPU_INT_ENABLE_SET(x) (((x) << POWER_REG_CPU_INT_ENABLE_LSB) & POWER_REG_CPU_INT_ENABLE_MASK)
#define POWER_REG_WLAN_ISO_DIS_MSB 6
#define POWER_REG_WLAN_ISO_DIS_LSB 6
#define POWER_REG_WLAN_ISO_DIS_MASK 0x00000040
#define POWER_REG_WLAN_ISO_DIS_GET(x) (((x)&POWER_REG_WLAN_ISO_DIS_MASK) >> POWER_REG_WLAN_ISO_DIS_LSB)
#define POWER_REG_WLAN_ISO_DIS_SET(x) (((x) << POWER_REG_WLAN_ISO_DIS_LSB) & POWER_REG_WLAN_ISO_DIS_MASK)
#define POWER_REG_WLAN_ISO_CNTL_MSB 5
#define POWER_REG_WLAN_ISO_CNTL_LSB 5
#define POWER_REG_WLAN_ISO_CNTL_MASK 0x00000020
#define POWER_REG_WLAN_ISO_CNTL_GET(x) (((x)&POWER_REG_WLAN_ISO_CNTL_MASK) >> POWER_REG_WLAN_ISO_CNTL_LSB)
#define POWER_REG_WLAN_ISO_CNTL_SET(x) (((x) << POWER_REG_WLAN_ISO_CNTL_LSB) & POWER_REG_WLAN_ISO_CNTL_MASK)
#define POWER_REG_RADIO_PWD_EN_MSB 4
#define POWER_REG_RADIO_PWD_EN_LSB 4
#define POWER_REG_RADIO_PWD_EN_MASK 0x00000010
#define POWER_REG_RADIO_PWD_EN_GET(x) (((x)&POWER_REG_RADIO_PWD_EN_MASK) >> POWER_REG_RADIO_PWD_EN_LSB)
#define POWER_REG_RADIO_PWD_EN_SET(x) (((x) << POWER_REG_RADIO_PWD_EN_LSB) & POWER_REG_RADIO_PWD_EN_MASK)
#define POWER_REG_SOC_SCALE_EN_MSB 3
#define POWER_REG_SOC_SCALE_EN_LSB 3
#define POWER_REG_SOC_SCALE_EN_MASK 0x00000008
#define POWER_REG_SOC_SCALE_EN_GET(x) (((x)&POWER_REG_SOC_SCALE_EN_MASK) >> POWER_REG_SOC_SCALE_EN_LSB)
#define POWER_REG_SOC_SCALE_EN_SET(x) (((x) << POWER_REG_SOC_SCALE_EN_LSB) & POWER_REG_SOC_SCALE_EN_MASK)
#define POWER_REG_WLAN_SCALE_EN_MSB 2
#define POWER_REG_WLAN_SCALE_EN_LSB 2
#define POWER_REG_WLAN_SCALE_EN_MASK 0x00000004
#define POWER_REG_WLAN_SCALE_EN_GET(x) (((x)&POWER_REG_WLAN_SCALE_EN_MASK) >> POWER_REG_WLAN_SCALE_EN_LSB)
#define POWER_REG_WLAN_SCALE_EN_SET(x) (((x) << POWER_REG_WLAN_SCALE_EN_LSB) & POWER_REG_WLAN_SCALE_EN_MASK)
#define POWER_REG_WLAN_PWD_EN_MSB 1
#define POWER_REG_WLAN_PWD_EN_LSB 1
#define POWER_REG_WLAN_PWD_EN_MASK 0x00000002
#define POWER_REG_WLAN_PWD_EN_GET(x) (((x)&POWER_REG_WLAN_PWD_EN_MASK) >> POWER_REG_WLAN_PWD_EN_LSB)
#define POWER_REG_WLAN_PWD_EN_SET(x) (((x) << POWER_REG_WLAN_PWD_EN_LSB) & POWER_REG_WLAN_PWD_EN_MASK)
#define POWER_REG_POWER_EN_MSB 0
#define POWER_REG_POWER_EN_LSB 0
#define POWER_REG_POWER_EN_MASK 0x00000001
#define POWER_REG_POWER_EN_GET(x) (((x)&POWER_REG_POWER_EN_MASK) >> POWER_REG_POWER_EN_LSB)
#define POWER_REG_POWER_EN_SET(x) (((x) << POWER_REG_POWER_EN_LSB) & POWER_REG_POWER_EN_MASK)

#define CORE_CLK_CTRL_ADDRESS 0x00000114
#define CORE_CLK_CTRL_OFFSET 0x00000114
#define CORE_CLK_CTRL_DIV_MSB 2
#define CORE_CLK_CTRL_DIV_LSB 0
#define CORE_CLK_CTRL_DIV_MASK 0x00000007
#define CORE_CLK_CTRL_DIV_GET(x) (((x)&CORE_CLK_CTRL_DIV_MASK) >> CORE_CLK_CTRL_DIV_LSB)
#define CORE_CLK_CTRL_DIV_SET(x) (((x) << CORE_CLK_CTRL_DIV_LSB) & CORE_CLK_CTRL_DIV_MASK)

#define SDIO_SETUP_CIRCUIT_ADDRESS 0x00000120
#define SDIO_SETUP_CIRCUIT_OFFSET 0x00000120
#define SDIO_SETUP_CIRCUIT_VECTOR_MSB 7
#define SDIO_SETUP_CIRCUIT_VECTOR_LSB 0
#define SDIO_SETUP_CIRCUIT_VECTOR_MASK 0x000000ff
#define SDIO_SETUP_CIRCUIT_VECTOR_GET(x) (((x)&SDIO_SETUP_CIRCUIT_VECTOR_MASK) >> SDIO_SETUP_CIRCUIT_VECTOR_LSB)
#define SDIO_SETUP_CIRCUIT_VECTOR_SET(x) (((x) << SDIO_SETUP_CIRCUIT_VECTOR_LSB) & SDIO_SETUP_CIRCUIT_VECTOR_MASK)

#define SDIO_SETUP_CONFIG_ADDRESS 0x00000140
#define SDIO_SETUP_CONFIG_OFFSET 0x00000140
#define SDIO_SETUP_CONFIG_ENABLE_MSB 1
#define SDIO_SETUP_CONFIG_ENABLE_LSB 1
#define SDIO_SETUP_CONFIG_ENABLE_MASK 0x00000002
#define SDIO_SETUP_CONFIG_ENABLE_GET(x) (((x)&SDIO_SETUP_CONFIG_ENABLE_MASK) >> SDIO_SETUP_CONFIG_ENABLE_LSB)
#define SDIO_SETUP_CONFIG_ENABLE_SET(x) (((x) << SDIO_SETUP_CONFIG_ENABLE_LSB) & SDIO_SETUP_CONFIG_ENABLE_MASK)
#define SDIO_SETUP_CONFIG_CLEAR_MSB 0
#define SDIO_SETUP_CONFIG_CLEAR_LSB 0
#define SDIO_SETUP_CONFIG_CLEAR_MASK 0x00000001
#define SDIO_SETUP_CONFIG_CLEAR_GET(x) (((x)&SDIO_SETUP_CONFIG_CLEAR_MASK) >> SDIO_SETUP_CONFIG_CLEAR_LSB)
#define SDIO_SETUP_CONFIG_CLEAR_SET(x) (((x) << SDIO_SETUP_CONFIG_CLEAR_LSB) & SDIO_SETUP_CONFIG_CLEAR_MASK)

#define CPU_SETUP_CONFIG_ADDRESS 0x00000144
#define CPU_SETUP_CONFIG_OFFSET 0x00000144
#define CPU_SETUP_CONFIG_ENABLE_MSB 1
#define CPU_SETUP_CONFIG_ENABLE_LSB 1
#define CPU_SETUP_CONFIG_ENABLE_MASK 0x00000002
#define CPU_SETUP_CONFIG_ENABLE_GET(x) (((x)&CPU_SETUP_CONFIG_ENABLE_MASK) >> CPU_SETUP_CONFIG_ENABLE_LSB)
#define CPU_SETUP_CONFIG_ENABLE_SET(x) (((x) << CPU_SETUP_CONFIG_ENABLE_LSB) & CPU_SETUP_CONFIG_ENABLE_MASK)
#define CPU_SETUP_CONFIG_CLEAR_MSB 0
#define CPU_SETUP_CONFIG_CLEAR_LSB 0
#define CPU_SETUP_CONFIG_CLEAR_MASK 0x00000001
#define CPU_SETUP_CONFIG_CLEAR_GET(x) (((x)&CPU_SETUP_CONFIG_CLEAR_MASK) >> CPU_SETUP_CONFIG_CLEAR_LSB)
#define CPU_SETUP_CONFIG_CLEAR_SET(x) (((x) << CPU_SETUP_CONFIG_CLEAR_LSB) & CPU_SETUP_CONFIG_CLEAR_MASK)

#define CPU_SETUP_CIRCUIT_ADDRESS 0x00000160
#define CPU_SETUP_CIRCUIT_OFFSET 0x00000160
#define CPU_SETUP_CIRCUIT_VECTOR_MSB 7
#define CPU_SETUP_CIRCUIT_VECTOR_LSB 0
#define CPU_SETUP_CIRCUIT_VECTOR_MASK 0x000000ff
#define CPU_SETUP_CIRCUIT_VECTOR_GET(x) (((x)&CPU_SETUP_CIRCUIT_VECTOR_MASK) >> CPU_SETUP_CIRCUIT_VECTOR_LSB)
#define CPU_SETUP_CIRCUIT_VECTOR_SET(x) (((x) << CPU_SETUP_CIRCUIT_VECTOR_LSB) & CPU_SETUP_CIRCUIT_VECTOR_MASK)

#define BB_SETUP_CONFIG_ADDRESS 0x00000180
#define BB_SETUP_CONFIG_OFFSET 0x00000180
#define BB_SETUP_CONFIG_ENABLE_MSB 1
#define BB_SETUP_CONFIG_ENABLE_LSB 1
#define BB_SETUP_CONFIG_ENABLE_MASK 0x00000002
#define BB_SETUP_CONFIG_ENABLE_GET(x) (((x)&BB_SETUP_CONFIG_ENABLE_MASK) >> BB_SETUP_CONFIG_ENABLE_LSB)
#define BB_SETUP_CONFIG_ENABLE_SET(x) (((x) << BB_SETUP_CONFIG_ENABLE_LSB) & BB_SETUP_CONFIG_ENABLE_MASK)
#define BB_SETUP_CONFIG_CLEAR_MSB 0
#define BB_SETUP_CONFIG_CLEAR_LSB 0
#define BB_SETUP_CONFIG_CLEAR_MASK 0x00000001
#define BB_SETUP_CONFIG_CLEAR_GET(x) (((x)&BB_SETUP_CONFIG_CLEAR_MASK) >> BB_SETUP_CONFIG_CLEAR_LSB)
#define BB_SETUP_CONFIG_CLEAR_SET(x) (((x) << BB_SETUP_CONFIG_CLEAR_LSB) & BB_SETUP_CONFIG_CLEAR_MASK)

#define BB_SETUP_CIRCUIT_ADDRESS 0x000001a0
#define BB_SETUP_CIRCUIT_OFFSET 0x000001a0
#define BB_SETUP_CIRCUIT_VECTOR_MSB 7
#define BB_SETUP_CIRCUIT_VECTOR_LSB 0
#define BB_SETUP_CIRCUIT_VECTOR_MASK 0x000000ff
#define BB_SETUP_CIRCUIT_VECTOR_GET(x) (((x)&BB_SETUP_CIRCUIT_VECTOR_MASK) >> BB_SETUP_CIRCUIT_VECTOR_LSB)
#define BB_SETUP_CIRCUIT_VECTOR_SET(x) (((x) << BB_SETUP_CIRCUIT_VECTOR_LSB) & BB_SETUP_CIRCUIT_VECTOR_MASK)

#define GPIO_WAKEUP_CONTROL_ADDRESS 0x000001c0
#define GPIO_WAKEUP_CONTROL_OFFSET 0x000001c0
#define GPIO_WAKEUP_CONTROL_ENABLE_MSB 0
#define GPIO_WAKEUP_CONTROL_ENABLE_LSB 0
#define GPIO_WAKEUP_CONTROL_ENABLE_MASK 0x00000001
#define GPIO_WAKEUP_CONTROL_ENABLE_GET(x) (((x)&GPIO_WAKEUP_CONTROL_ENABLE_MASK) >> GPIO_WAKEUP_CONTROL_ENABLE_LSB)
#define GPIO_WAKEUP_CONTROL_ENABLE_SET(x) (((x) << GPIO_WAKEUP_CONTROL_ENABLE_LSB) & GPIO_WAKEUP_CONTROL_ENABLE_MASK)

