alibaba/AliOS-Things/platform/mcu/lpc54102/wifi_qca/include/AR6002/hw2.0/hw/hw20_rtc_reg.h
#ifndef __ASSEMBLER__

typedef struct rtc_reg_reg_s
{
    volatile unsigned int reset_control;
    volatile unsigned int xtal_control;
    volatile unsigned int tcxo_detect;
    volatile unsigned int xtal_test;
    volatile unsigned int quadrature;
    volatile unsigned int pll_control;
    volatile unsigned int pll_settle;
    volatile unsigned int xtal_settle;
    volatile unsigned int cpu_clock;
    volatile unsigned int clock_out;
    volatile unsigned int clock_control;
    volatile unsigned int bias_override;
    volatile unsigned int wdt_control;
    volatile unsigned int wdt_status;
    volatile unsigned int wdt;
    volatile unsigned int wdt_count;
    volatile unsigned int wdt_reset;
    volatile unsigned int int_status;
    volatile unsigned int lf_timer0;
    volatile unsigned int lf_timer_count0;
    volatile unsigned int lf_timer_control0;
    volatile unsigned int lf_timer_status0;
    volatile unsigned int lf_timer1;
    volatile unsigned int lf_timer_count1;
    volatile unsigned int lf_timer_control1;
    volatile unsigned int lf_timer_status1;
    volatile unsigned int lf_timer2;
    volatile unsigned int lf_timer_count2;
    volatile unsigned int lf_timer_control2;
    volatile unsigned int lf_timer_status2;
    volatile unsigned int lf_timer3;
    volatile unsigned int lf_timer_count3;
    volatile unsigned int lf_timer_control3;
    volatile unsigned int lf_timer_status3;
    volatile unsigned int hf_timer;
    volatile unsigned int hf_timer_count;
    volatile unsigned int hf_lf_count;
    volatile unsigned int hf_timer_control;
    volatile unsigned int hf_timer_status;
    volatile unsigned int rtc_control;
    volatile unsigned int rtc_time;
    volatile unsigned int rtc_date;
    volatile unsigned int rtc_set_time;
    volatile unsigned int rtc_set_date;
    volatile unsigned int rtc_set_alarm;
    volatile unsigned int rtc_config;
    volatile unsigned int rtc_alarm_status;
    volatile unsigned int uart_wakeup;
    volatile unsigned int reset_cause;
    volatile unsigned int system_sleep;
    volatile unsigned int sdio_wrapper;
    volatile unsigned int mac_sleep_control;
    volatile unsigned int keep_awake;
    volatile unsigned int lpo_cal_time;
    volatile unsigned int lpo_init_dividend_int;
    volatile unsigned int lpo_init_dividend_fraction;
    volatile unsigned int lpo_cal;
    volatile unsigned int lpo_cal_test_control;
    volatile unsigned int lpo_cal_test_status;
    volatile unsigned int chip_id;
    volatile unsigned int derived_rtc_clk;
    volatile unsigned int mac_pcu_slp32_mode;
    volatile unsigned int mac_pcu_slp32_wake;
    volatile unsigned int mac_pcu_slp32_inc;
    volatile unsigned int mac_pcu_slp_mib1;
    volatile unsigned int mac_pcu_slp_mib2;
    volatile unsigned int mac_pcu_slp_mib3;
    volatile unsigned int mac_pcu_slp_beacon;
    volatile unsigned int power_reg;
    volatile unsigned int core_clk_ctrl;
    unsigned char pad0[8]; /* pad to 0x120 */
    volatile unsigned int sdio_setup_circuit[8];
    volatile unsigned int sdio_setup_config;
    volatile unsigned int cpu_setup_config;
    unsigned char pad1[24]; /* pad to 0x160 */
    volatile unsigned int cpu_setup_circuit[8];
    volatile unsigned int bb_setup_config;
    unsigned char pad2[28]; /* pad to 0x1a0 */
    volatile unsigned int bb_setup_circuit[8];
    volatile unsigned int gpio_wakeup_control;
} rtc_reg_reg_t;

#endif /* __ASSEMBLER__ */

#endif /* _RTC_REG_H_ */
